Repository: OpenIoTHub/OpenIoTHub
Catalog: packages/openiothub_common_pages/lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ja, ko, ru, zh_cn, zh_hant

source: Click to get WiFi info
ar: الحصول على معلومات WiFi
de: WiFi-Informationen abrufen
es: Obtener información WiFi
fr: Obtenir les infos WiFi
it: Ottieni informazioni WiFi
ja: WiFi情報を取得
ko: WiFi 정보 가져오기
ru: Получить информацию WiFi
zh_cn: 点击获取WiFi信息
zh_hant: 點擊獲取WiFi信息

source: Input WiFi password
ar: أدخل كلمة مرور WiFi
de: WiFi-Passwort eingeben
es: Introducir contraseña WiFi
fr: Saisir le mot de passe WiFi
it: Inserisci password WiFi
ja: WiFiパスワードを入力
ko: WiFi 비밀번호 입력
ru: Введите пароль WiFi
zh_cn: 上面输入wifi密码开始设置设备联网
zh_hant: 上面輸入wifi密碼開始設置設備聯網

source: Connecting_to_router
ar: الاتصال بالموجه
de: Verbinde mit Router
es: Conectando al router
fr: Connexion au routeur
it: Connessione al router
ja: ルーターに接続中
ko: 라우터 연결 중
ru: Подключение к роутеру
zh_cn: 正在设置设备连接到路由器
zh_hant: 正在設置設備連接到路由器

source: Device WiFi config
ar: إعدادات WiFi للجهاز
de: Geräte-WiFi-Konfiguration
es: Configuración WiFi del dispositivo
fr: Configuration WiFi de l'appareil
it: Configurazione WiFi dispositivo
ja: デバイスWiFi設定
ko: 기기 WiFi 설정
ru: Настройка WiFi устройства
zh_cn: 设备配网
zh_hant: 設備配網

source: Start adding surrounding smart devices
ar: بدء إضافة الأجهزة الذكية القريبة
de: Umgebungs-Smart-Geräte hinzufügen
es: Comenzar a añadir dispositivos inteligentes cercanos
fr: Commencer à ajouter les appareils intelligents proches
it: Inizia ad aggiungere dispositivi intelligenti vicini
ja: 周辺スマートデバイスを追加開始
ko: 주변 스마트 기기 추가 시작
ru: Начать добавление умных устройств поблизости
zh_cn: 开始添加周围智能设备
zh_hant: 開始添加周圍智能設備

source: WiFi info can't be empty
ar: معلومات WiFi لا يمكن أن تكون فارغة
de: WiFi-Informationen dürfen nicht leer sein
es: La información WiFi no puede estar vacía
fr: Les infos WiFi ne peuvent pas être vides
it: Le informazioni WiFi non possono essere vuote
ja: WiFi情報は空にできません
ko: WiFi 정보는 비워둘 수 없습니다
ru: Информация WiFi не может быть пустой
zh_cn: WiFi信息不能为空
zh_hant: WiFi信息不能為空

# discovering_device_please_wait
source: Discovering device, please be patient and wait for approximately one minute
ar: البحث عن الجهاز، انتظر حوالي دقيقة
de: Gerät wird gesucht, bitte etwa eine Minute warten
es: Buscando dispositivo, espere aproximadamente un minuto
fr: Recherche de l'appareil, attendez environ une minute
it: Ricerca dispositivo, attendere circa un minuto
ja: デバイスを検出中。約1分お待ちください
ko: 기기 검색 중，약 1분 기다려 주세요
ru: Поиск устройства, подождите около минуты
zh_cn: 正在发现设备，请耐心等待，大概需要一分钟
zh_hant: 正在發現設備，請耐心等待，大概需要一分鐘

# please_input_2p4g_wifi_password
source: Enter the router WIFI (2.4G frequency) password to start network distribution
ar: أدخل كلمة مرور WiFi الموجه (2.4G) لبدء التوزيع
de: Router-WiFi-Passwort (2,4 GHz) eingeben, um die Verteilung zu starten
es: Introduzca la contraseña WiFi del router (2.4G) para iniciar la distribución
fr: Saisissez le mot de passe WiFi du routeur (2.4G) pour démarrer la distribution
it: Inserisci password WiFi router (2.4G) per avviare la distribuzione
ja: ルーターWiFi（2.4G）パスワードを入力して配布を開始
ko: 라우터 WiFi（2.4G）비밀번호를 입력하여 배포를 시작하세요
ru: Введите пароль WiFi роутера (2.4G) для начала распределения
zh_cn: 输入路由器WIFI(2.4G频率)密码后开始配网
zh_hant: 輸入路由器WIFI(2.4G頻率)密碼後開始配網

# airkiss_device_wifi_config_success
source: The nearby AirKiss equipment distribution task has been completed
ar: اكتمل توزيع أجهزة AirKiss
de: AirKiss-Geräteverteilung abgeschlossen
es: Distribución de equipos AirKiss completada
fr: Distribution des équipements AirKiss terminée
it: Distribuzione dispositivi AirKiss completata
ja: AirKiss機器の配布が完了しました
ko: AirKiss 장비 배포가 완료되었습니다
ru: Распределение устройств AirKiss завершено
zh_cn: 附近的AirKiss设备配网任务完成
zh_hant: 附近的AirKiss設備配網任務完成

# bind_wechat_success
source: WeChat binding successful!
ar: ربط WeChat ناجح!
de: WeChat-Verbindung erfolgreich!
es: ¡Vinculación WeChat exitosa!
fr: Liaison WeChat réussie!
it: Collegamento WeChat riuscito!
ja: WeChat連携に成功しました！
ko: WeChat 연동 성공！
ru: Привязка WeChat успешна!
zh_cn: 绑定微信成功！
zh_hant: 綁定微信成功！

# bind_wechat_failed
source: Binding WeChat failed!
ar: فشل ربط WeChat!
de: WeChat-Verbindung fehlgeschlagen!
es: ¡Error al vincular WeChat!
fr: Échec de la liaison WeChat!
it: Collegamento WeChat fallito!
ja: WeChat連携に失敗しました
ko: WeChat 연동 실패
ru: Ошибка привязки WeChat!
zh_cn: 绑定微信失败
zh_hant: 綁定微信失敗

# get_wechat_login_info_failed
source: Failed to obtain WeChat login information
ar: فشل الحصول على بيانات WeChat
de: WeChat-Anmeldeinformationen konnten nicht abgerufen werden
es: No se pudieron obtener las credenciales de WeChat
fr: Impossible d'obtenir les identifiants WeChat
it: Impossibile ottenere credenziali WeChat
ja: WeChatログイン情報の取得に失敗しました
ko: WeChat 로그인 정보 조회 실패
ru: Не удалось получить данные WeChat
zh_cn: 获取微信登录信息失败
zh_hant: 獲取微信登錄信息失敗

source: Account and safety
ar: الحساب والأمان
de: Konto und Sicherheit
es: Cuenta y seguridad
fr: Compte et sécurité
it: Account e sicurezza
ja: アカウントとセキュリティ
ko: 계정 및 보안
ru: Аккаунт и безопасность
zh_cn: 账号及安全
zh_hant: 賬號及安全

source: Mobile number
ar: رقم الجوال
de: Handynummer
es: Número de móvil
fr: Numéro de mobile
it: Numero cellulare
ja: 携帯番号
ko: 휴대폰 번호
ru: Номер телефона
zh_cn: 电话号码
zh_hant: 電話號碼

source: Username
ar: اسم المستخدم
de: Benutzername
es: Nombre de usuario
fr: Nom d'utilisateur
it: Nome utente
ja: ユーザー名
ko: 사용자 이름
ru: Имя пользователя
zh_cn: 用户名
zh_hant: 用戶名

source: User mobile
ar: جوال المستخدم
de: Benutzer-Handy
es: Móvil del usuario
fr: Mobile de l'utilisateur
it: Cellulare utente
ja: ユーザー携帯
ko: 사용자 휴대폰
ru: Телефон пользователя
zh_cn: 手机号
zh_hant: 手機號

source: User email
ar: بريد المستخدم
de: E-Mail-Adresse
es: Correo del usuario
fr: Email de l'utilisateur
it: Email utente
ja: メールアドレス
ko: 이메일
ru: Email пользователя
zh_cn: 邮箱
zh_hant: 郵箱

source: Modify password
ar: تعديل كلمة المرور
de: Passwort ändern
es: Modificar contraseña
fr: Modifier le mot de passe
it: Modifica password
ja: パスワード変更
ko: 비밀번호 변경
ru: Изменить пароль
zh_cn: 修改密码
zh_hant: 修改密碼

source: Password
ar: كلمة المرور
de: Passwort
es: Contraseña
fr: Mot de passe
ja: パスワード
ko: 비밀번호
ru: Пароль
zh_cn: 密码
zh_hant: 密碼

source: Bind wechat
ar: ربط WeChat
de: WeChat verbinden
es: Vincular WeChat
fr: Lier WeChat
it: Collega WeChat
ja: WeChatを連携
ko: WeChat 연동
ru: Привязать WeChat
zh_cn: 绑定微信
zh_hant: 綁定微信

source: No wechat installed
ar: WeChat غير مثبت
de: WeChat nicht installiert
es: WeChat no instalado
fr: WeChat non installé
it: WeChat non installato
ja: WeChatがインストールされていません
ko: WeChat이 설치되어 있지 않습니다
ru: WeChat не установлен
zh_cn: 只有安装了微信才能绑定微信
zh_hant: 只有安裝了微信才能綁定微信

source: Unbind wechat
ar: إلغاء ربط WeChat
de: WeChat-Verbindung trennen
es: Desvincular WeChat
fr: Délier WeChat
it: Scollega WeChat
ja: WeChat連携を解除
ko: WeChat 연동 해제
ru: Отвязать WeChat
zh_cn: 解除微信绑定
zh_hant: 解除微信綁定

source: Unbind wechat success!
ar: تم إلغاء ربط WeChat!
de: WeChat-Verbindung getrennt!
es: ¡WeChat desvinculado!
fr: WeChat délié!
it: WeChat scollegato!
ja: WeChat連携解除に成功しました！
ko: WeChat 연동 해제 성공！
ru: WeChat отвязан!
zh_cn: 解绑微信成功！
zh_hant: 解綁微信成功！

source: Unbind wechat failed,reason:
ar: فشل إلغاء ربط WeChat، السبب:
de: WeChat-Verbindung trennen fehlgeschlagen, Grund:
es: Error al desvincular WeChat, razón:
fr: Échec du déliage WeChat, raison:
it: Scollegamento WeChat fallito, motivo:
ja: WeChat連携解除に失敗。理由：
ko: WeChat 연동 해제 실패，이유：
ru: Ошибка отвязки WeChat, причина:
zh_cn: 解绑微信失败！原因：
zh_hant: 解綁微信失敗！原因：

source: Cancel account
ar: إلغاء الحساب
de: Konto kündigen
es: Cancelar cuenta
fr: Annuler le compte
it: Annulla account
ja: アカウント解約
ko: 계정 해지
ru: Отменить аккаунт
zh_cn: 注销账号
zh_hant: 註銷賬號

source: Modify
ar: تعديل
de: Ändern
es: Modificar
fr: Modifier
it: Modifica
ja: 変更
ko: 수정
ru: Изменить
zh_cn: 修改
zh_hant: 修改

source: Please input new value
ar: يرجى إدخال قيمة جديدة
de: Bitte geben Sie einen neuen Wert ein
es: Por favor ingrese un nuevo valor
fr: Veuillez saisir une nouvelle valeur
it: Inserisci un nuovo valore
ja: 新しい値を入力してください
ko: 새 값을 입력하세요
ru: Пожалуйста, введите новое значение
zh_cn: 请输入新的
zh_hant: 請輸入新的

source: New value
ar: قيمة جديدة
de: Neuer Wert
es: Nuevo valor
fr: Nouvelle valeur
it: Nuovo valore
ja: 新しい値
ko: 새 값
ru: Новое значение
zh_cn: 新值
zh_hant: 新值

source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
ru: Отмена
zh_cn: 取消
zh_hant: 取消

source: OK
ar: موافق
ko: 확인
ru: ОК
zh_cn: 确定
zh_hant: 確定

source: Cancel my account
ar: إلغاء حسابي
de: Mein Konto kündigen
es: Cancelar mi cuenta
fr: Annuler mon compte
it: Annulla il mio account
ja: アカウント解約
ko: 계정 해지
ru: Отменить мой аккаунт
zh_cn: 删除我的账号
zh_hant: 刪除我的賬號

# cancel_my_account_notify1
source: Please note that after confirming the deletion, the deletion operation will take effect immediately and cannot be restored!
ar: بعد التأكيد سيتم حذف الحساب فوراً ولا يمكن استعادته!
de: Nach Bestätigung wird das Konto sofort gelöscht und kann nicht wiederhergestellt werden!
es: Tras confirmar, la cuenta se eliminará inmediatamente y no se puede restaurar!
fr: Après confirmation, le compte sera supprimé immédiatement et ne peut pas être restauré!
it: Dopo la conferma, l'account verrà eliminato immediatamente e non può essere ripristinato!
ja: 削除確認後、即時反映され復元できません！
ko: 삭제 확인 후 즉시 적용되며 복구할 수 없습니다！
ru: После подтверждения аккаунт будет удалён немедленно и не может быть восстановлен!
zh_cn: 请注意，确认删除之后删除操作立马生效，且不可恢复！
zh_hant: 請注意，確認刪除之後刪除操作立馬生效，且不可恢復！

source: Operation cannot be restored!
ar: لا يمكن استعادة العملية!
de: Vorgang kann nicht wiederhergestellt werden!
es: ¡La operación no se puede restaurar!
fr: L'opération ne peut pas être restaurée!
it: L'operazione non può essere ripristinata!
ja: 操作は復元できません！
ko: 작업은 복구할 수 없습니다！
ru: Операция не может быть восстановлена!
zh_cn: 操作不可恢复！
zh_hant: 操作不可恢復！

source: Please input your password
ar: أدخل كلمة المرور
de: Bitte geben Sie Ihr Passwort ein
es: Introduzca su contraseña
fr: Saisissez votre mot de passe
it: Inserisci la tua password
ja: パスワードを入力してください
ko: 비밀번호를 입력하세요
ru: Введите ваш пароль
zh_cn: 请输入你的密码
zh_hant: 請輸入你的密碼

source: Current account password
ar: كلمة مرور الحساب الحالية
de: Aktuelles Kontopasswort
es: Contraseña actual de la cuenta
fr: Mot de passe actuel du compte
it: Password attuale dell'account
ja: 現在のアカウントパスワード
ko: 현재 계정 비밀번호
ru: Текущий пароль аккаунта
zh_cn: 当前账号的密码
zh_hant: 當前賬號的密碼

source: Confirm cancel account?
ar: إلغاء الحساب؟
de: Konto wirklich kündigen?
es: ¿Cancelar la cuenta?
fr: Annuler le compte?
it: Annullare l'account?
ja: アカウントを解約しますか？
ko: 계정을 해지하시겠습니까？
ru: Отменить аккаунт?
zh_cn: 确认删除账号?
zh_hant: 確認刪除賬號?

source: Cancel account success!
ar: تم إلغاء الحساب!
de: Konto erfolgreich gekündigt!
es: ¡Cuenta cancelada!
fr: Compte annulé!
it: Account annullato!
ja: アカウント解約に成功しました！
ko: 계정 해지 성공！
ru: Аккаунт отменён!
zh_cn: 删除账号成功！
zh_hant: 刪除賬號成功！

source: Cancel account failed
ar: فشل إلغاء الحساب
de: Konto kündigen fehlgeschlagen
es: Error al cancelar la cuenta
fr: Échec de l'annulation du compte
it: Annullamento account fallito
ja: アカウント解約に失敗しました
ko: 계정 해지 실패
ru: Ошибка отмены аккаунта
zh_cn: 删除账号失败
zh_hant: 刪除賬號失敗

source: Wechat login failed
ar: فشل تسجيل الدخول WeChat
de: WeChat-Anmeldung fehlgeschlagen
es: Error de inicio de sesión de WeChat
fr: Échec de la connexion WeChat
it: Accesso WeChat fallito
ja: WeChatログインに失敗しました
ko: WeChat 로그인 실패
ru: Ошибка входа WeChat
zh_cn: 微信登录失败
zh_hant: 微信登錄失敗

source: Login
ar: تسجيل الدخول
de: Anmelden
es: Iniciar sesión
fr: Se connecter
it: Accedi
ja: ログイン
ko: 로그인
ru: Войти
zh_cn: 登录
zh_hant: 登錄

source: Please input mobile
ar: أدخل رقم الجوال
de: Bitte geben Sie Ihre Handynummer ein
es: Introduzca su número de móvil
fr: Veuillez entrer votre numéro de mobile
it: Inserisci il tuo numero di cellulare
ja: 携帯電話番号を入力してください
ko: 휴대폰 번호를 입력하세요
ru: Введите номер телефона
zh_cn: 请输入手机号
zh_hant: 請輸入手機號

source: Please input password
ar: أدخل كلمة المرور
de: Bitte geben Sie Ihr Passwort ein
es: Introduzca su contraseña
fr: Veuillez entrer votre mot de passe
it: Inserisci la tua password
ja: パスワードを入力してください
ko: 비밀번호를 입력하세요
ru: Введите пароль
zh_cn: 请输入用户密码
zh_hant: 請輸入用戶密碼

# agree_to_the_user_agreement1
source: Please check the box
ar: حدد المربع
de: Bitte klicken Sie das Kästchen an
es: Marque la casilla
fr: Veuillez cocher la case
it: Seleziona la casella
ja: チェックボックスにチェックを入れてください
ko: 체크박스에 체크하세요
ru: Установите флажок
zh_cn: 请勾选
zh_hant: 請勾選

# agree_to_the_user_agreement2
source: Only by agreeing to the privacy policy below can we proceed to the next step
ar: فقط بالموافقة على سياسة الخصوصية أدناه يمكننا المتابعة
de: Nur durch Zustimmung zur unten stehenden Datenschutzrichtlinie können wir zum nächsten Schritt fortfahren
es: Solo aceptando la política de privacidad a continuación podemos continuar
fr: En acceptant la politique de confidentialité ci-dessous, nous pouvons passer à l'étape suivante
it: Solo accettando la politica sulla privacy qui sotto possiamo procedere
ja: 以下のプライバシーポリシーに同意した場合のみ、次のステップに進むことができます
ko: 아래 개인정보 보호정책에 동의한 경우에만 다음 단계로 진행할 수 있습니다
ru: Только согласившись с политикой конфиденциальности ниже, мы можем перейти к следующему шагу
zh_cn: 下述同意隐私政策才可以进行下一步
zh_hant: 下述同意隱私政策才可以進行下一步

# username_and_password_cant_be_empty
source: Username and password cannot be empty
ar: اسم المستخدم وكلمة المرور لا يمكن أن يكونا فارغين
de: Benutzername und Passwort dürfen nicht leer sein
es: El nombre de usuario y la contraseña no pueden estar vacíos
fr: Le nom d'utilisateur et le mot de passe ne peuvent pas être vides
it: Nome utente e password non possono essere vuoti
ja: ユーザー名とパスワードは空にできません
ko: 사용자 이름과 비밀번호는 비워둘 수 없습니다
ru: Имя пользователя и пароль не могут быть пустыми
zh_cn: 用户名与密码不能为空
zh_hant: 用戶名與密碼不能為空

source: User registration
ar: تسجيل المستخدم
de: Benutzerregistrierung
es: Registro de usuario
fr: Inscription utilisateur
it: Registrazione utente
ja: ユーザー登録
ko: 사용자 등록
ru: Регистрация пользователя
zh_cn: 用户注册
zh_hant: 用戶註冊

source: Agree
ar: موافق
de: Zustimmen
es: Aceptar
fr: Accepter
it: Accetta
ja: 同意
ko: 동의
ru: Согласен
zh_cn: 同意
zh_hant: 同意

source: Privacy policy
ar: سياسة الخصوصية
de: Datenschutzrichtlinie
es: Política de privacidad
fr: Politique de confidentialité
it: Politica sulla privacy
ja: プライバシーポリシー
ko: 개인정보 보호정책
ru: Политика конфиденциальности
zh_cn: 隐私政策
zh_hant: 隱私政策

source: Feedback channels
ar: قنوات الملاحظات
de: Feedback-Kanäle
es: Canales de comentarios
fr: Canaux de commentaires
it: Canali feedback
ja: フィードバックチャネル
ko: 피드백 채널
ru: Каналы обратной связи
zh_cn: 反馈渠道
zh_hant: 反饋渠道

source: Get wechat qr code failed！
ar: فشل الحصول على رمز QR WeChat！
de: WeChat-QR-Code abrufen fehlgeschlagen！
es: ¡Error al obtener el código QR de WeChat！
fr: Échec de l'obtention du code QR WeChat！
it: Errore nell'ottenere il codice QR WeChat！
ja: WeChat QRコードの取得に失敗しました！
ko: WeChat QR 코드 가져오기 실패！
ru: Ошибка получения QR-кода WeChat！
zh_cn: 获取微信登陆二维码失败！
zh_hant: 獲取微信登陸二維碼失敗！

source: Wechat scan qr code to login!
ar: امسح رمز QR WeChat لتسجيل الدخول!
de: WeChat-QR-Code scannen, um sich anzumelden!
es: ¡Escanee el código QR de WeChat para iniciar sesión!
fr: Scannez le code QR WeChat pour vous connecter!
it: Scansiona il codice QR WeChat per accedere!
ja: WeChat QRコードをスキャンしてログイン！
ko: WeChat QR 코드를 스캔하여 로그인하세요!
ru: Отсканируйте QR-код WeChat для входа!
zh_cn: 微信扫码登录！
zh_hant: 微信掃碼登錄！

source: Exit
ar: خروج
de: Beenden
es: Salir
fr: Quitter
it: Esci
ja: 終了
ko: 종료
ru: Выход
zh_cn: 退出
zh_hant: 退出

source: Login failed
ar: فشل تسجيل الدخول
de: Anmeldung fehlgeschlagen
es: Error de inicio de sesión
fr: Échec de la connexion
it: Accesso fallito
ja: ログインに失敗しました
ko: 로그인 실패
ru: Ошибка входа
zh_cn: 登录失败
zh_hant: 登錄失敗

# login_after_wechat_bind
source: Please bind this WeChat account and use WeChat Quick Login now
ar: يرجى ربط حساب WeChat هذا واستخدام تسجيل الدخول السريع WeChat الآن
de: Bitte binden Sie dieses WeChat-Konto und verwenden Sie jetzt WeChat-Schnellanmeldung
es: Por favor vincule esta cuenta de WeChat y use el inicio de sesión rápido de WeChat ahora
fr: Veuillez lier ce compte WeChat et utiliser la connexion rapide WeChat maintenant
it: Collega questo account WeChat e usa l'accesso rapido WeChat ora
ja: このWeChatアカウントを連携し、WeChatクイックログインを使用してください
ko: 이 WeChat 계정을 연동하고 WeChat 빠른 로그인을 사용하세요
ru: Привяжите этот аккаунт WeChat и используйте быстрый вход WeChat
zh_cn: 请现将本微信绑定一个账号再使用微信快捷登录
zh_hant: 請現將本微信綁定一個賬號再使用微信快捷登錄

# wechat_fast_login_failed
source: WeChat quick login failed
ar: فشل تسجيل الدخول السريع WeChat
de: WeChat-Schnellanmeldung fehlgeschlagen
es: Error en el inicio de sesión rápido de WeChat
fr: Échec de la connexion rapide WeChat
it: Accesso rapido WeChat fallito
ja: WeChatクイックログインに失敗しました
ko: WeChat 빠른 로그인 실패
ru: Ошибка быстрого входа WeChat
zh_cn: 微信快捷登录失败
zh_hant: 微信快捷登錄失敗

source: Register
ar: تسجيل
de: Registrieren
es: Registrarse
fr: S'inscrire
it: Registrati
ja: 登録
ko: 등록
ru: Регистрация
zh_cn: 注册
zh_hant: 註冊

# register_success
source: Registered successfully Please log in with your registration information!
ar: تم التسجيل بنجاح! يرجى تسجيل الدخول بمعلومات التسجيل
de: Erfolgreich registriert! Bitte melden Sie sich mit Ihren Registrierungsdaten an!
es: ¡Registro exitoso! Inicie sesión con su información de registro
fr: Inscription réussie! Veuillez vous connecter avec vos informations d'inscription
it: Registrazione riuscita! Accedi con le tue informazioni di registrazione
ja: 登録に成功しました。登録情報でログインしてください！
ko: 등록 성공! 등록 정보로 로그인하세요
ru: Регистрация успешна! Войдите с вашими данными регистрации
zh_cn: 注册成功!请使用注册信息登录!
zh_hant: 註冊成功!請使用註冊信息登錄!

# register_failed
source: Registration failed! Please register again
ar: فشل التسجيل! يرجى التسجيل مرة أخرى
de: Registrierung fehlgeschlagen! Bitte registrieren Sie sich erneut
es: ¡Error en el registro! Por favor regístrese nuevamente
fr: Échec de l'inscription! Veuillez vous réinscrire
it: Registrazione fallita! Registrati di nuovo
ja: 登録に失敗しました！再度登録してください
ko: 등록 실패! 다시 등록하세요
ru: Ошибка регистрации! Зарегистрируйтесь снова
zh_cn: 注册失败!请重新注册
zh_hant: 註冊失敗!請重新註冊

source: User info
ar: معلومات المستخدم
de: Benutzerinformationen
es: Información del usuario
fr: Informations utilisateur
it: Informazioni utente
ja: ユーザー情報
ko: 사용자 정보
ru: Информация пользователя
zh_cn: 用户信息
zh_hant: 用戶信息

source: Logout
ar: تسجيل الخروج
de: Abmelden
es: Cerrar sesión
fr: Se déconnecter
it: Esci
ja: ログアウト
ko: 로그아웃
ru: Выйти
zh_cn: 退出登录
zh_hant: 退出登錄

source: Share success!
ar: نجح المشاركة!
de: Teilen erfolgreich!
es: ¡Compartir exitoso!
fr: Partage réussi!
it: Condivisione riuscita!
ja: 共有に成功しました！
ko: 공유 성공!
ru: Поделиться успешно!
zh_cn: 分享成功！
zh_hant: 分享成功！

source: Share failed!
ar: فشل المشاركة!
de: Teilen fehlgeschlagen!
es: ¡Error al compartir!
fr: Échec du partage!
it: Condivisione fallita!
ja: 共有に失敗しました！
ko: 공유 실패!
ru: Ошибка при отправке!
zh_cn: 分享失败！
zh_hant: 分享失敗！

source: As a gateway
ar: كبوابة
de: Als Gateway
es: Como puerta de enlace
fr: Comme passerelle
it: Come gateway
ja: ゲートウェイとして
ko: 게이트웨이로
ru: Как шлюз
zh_cn: 本机作为网关
zh_hant: 本機作為網關

# as_a_gateway_description1
source: Scan the QR code above using the OpenIoTHub APP to add this gateway and access this network
ar: امسح رمز QR أعلاه باستخدام تطبيق OpenIoTHub لإضافة هذه البوابة والوصول إلى هذه الشبكة
de: Scannen Sie den QR-Code oben mit der OpenIoTHub-App, um dieses Gateway hinzuzufügen und auf dieses Netzwerk zuzugreifen
es: Escanee el código QR de arriba usando la APP OpenIoTHub para añadir esta puerta de enlace y acceder a esta red
fr: Scannez le code QR ci-dessus avec l'application OpenIoTHub pour ajouter cette passerelle et accéder à ce réseau
it: Scansiona il codice QR sopra usando l'app OpenIoTHub per aggiungere questo gateway e accedere a questa rete
ja: 上のQRコードをOpenIoTHubアプリでスキャンして、このゲートウェイを追加し、このネットワークにアクセスしてください
ko: OpenIoTHub 앱을 사용하여 위의 QR 코드를 스캔하여 이 게이트웨이를 추가하고 이 네트워크에 액세스하세요
ru: Отсканируйте QR-код выше с помощью приложения OpenIoTHub, чтобы добавить этот шлюз и получить доступ к этой сети
zh_cn: 使用云亿连APP扫描上述二维码添加本网关以访问本网络
zh_hant: 使用雲億連APP掃描上述二維碼添加本網關以訪問本網絡

source: Change gateway id
ar: تغيير معرف البوابة
de: Gateway-ID ändern
es: Cambiar ID de puerta de enlace
fr: Changer l'ID de la passerelle
it: Cambia ID gateway
ja: ゲートウェイIDを変更
ko: 게이트웨이 ID 변경
ru: Изменить ID шлюза
zh_cn: 更换网关ID
zh_hant: 更換網關ID

# go_to_main_menu
source: Return to the main interface
ar: العودة إلى الواجهة الرئيسية
de: Zur Hauptoberfläche zurückkehren
es: Volver a la interfaz principal
fr: Retourner à l'interface principale
it: Torna all'interfaccia principale
ja: メインインターフェースに戻る
ko: 메인 인터페이스로 돌아가기
ru: Вернуться к главному интерфейсу
zh_cn: 返回主界面
zh_hant: 返回主界面

# share_to_wechat
source: Share on WeChat
ar: مشاركة على WeChat
de: Auf WeChat teilen
es: Compartir en WeChat
fr: Partager sur WeChat
it: Condividi su WeChat
ja: WeChatで共有
ko: WeChat에서 공유
ru: Поделиться в WeChat
zh_cn: 分享到微信
zh_hant: 分享到微信

# select_where_to_share
source: Choose the location for the demander to share
ar: اختر موقع المشاركة
de: Wählen Sie den Ort zum Teilen
es: Elegir el lugar para compartir
fr: Choisir l'endroit pour partager
it: Scegli il luogo per condividere
ja: 共有する場所を選択
ko: 공유할 위치 선택
ru: Выберите место для отправки
zh_cn: 选择需方分享的位置
zh_hant: 選擇需方分享的位置

# openiothub_gateway_share
source: OpenIoTHub Gateway Sharing
ar: مشاركة بوابة OpenIoTHub
de: OpenIoTHub-Gateway-Freigabe
es: Compartir puerta de enlace OpenIoTHub
fr: Partage de passerelle OpenIoTHub
it: Condivisione gateway OpenIoTHub
ja: OpenIoTHubゲートウェイ共有
ko: OpenIoTHub 게이트웨이 공유
ru: Обмен шлюзом OpenIoTHub
zh_cn: 云亿连网关分享
zh_hant: 雲億連網關分享

# openiothub_gateway_share_description
source: Use OpenIoTHub to scan the QR code and add a gateway to manage all your smart devices and private clouds
ar: استخدم OpenIoTHub لمسح رمز QR وإضافة بوابة لإدارة جميع أجهزتك الذكية والسحابات الخاصة
de: Verwenden Sie OpenIoTHub, um den QR-Code zu scannen und ein Gateway hinzuzufügen, um alle Ihre Smart-Geräte und Private Clouds zu verwalten
es: Use OpenIoTHub para escanear el código QR y añadir una puerta de enlace para gestionar todos sus dispositivos inteligentes y nubes privadas
fr: Utilisez OpenIoTHub pour scanner le code QR et ajouter une passerelle pour gérer tous vos appareils intelligents et clouds privés
it: Usa OpenIoTHub per scansionare il codice QR e aggiungere un gateway per gestire tutti i tuoi dispositivi intelligenti e cloud privati
ja: OpenIoTHubを使用してQRコードをスキャンし、ゲートウェイを追加して、すべてのスマートデバイスとプライベートクラウドを管理します
ko: OpenIoTHub를 사용하여 QR 코드를 스캔하고 게이트웨이를 추가하여 모든 스마트 기기와 프라이빗 클라우드를 관리하세요
ru: Используйте OpenIoTHub для сканирования QR-кода и добавления шлюза для управления всеми вашими умными устройствами и частными облаками
zh_cn: 使用云亿连扫码二维码添加网关，管理您的所有智能设备和私有云
zh_hant: 使用雲億連掃碼二維碼添加網關，管理您的所有智能設備和私有雲

source: App name:
ar: اسم التطبيق:
es: Nombre de la app:
fr: Nom de l'app:
it: Nome app:
ja: アプリ名:
ko: 앱 이름:
ru: Имя приложения:
zh_cn: App名称:
zh_hant: App名稱:

source: Package name:
ar: اسم الحزمة:
de: Paketname:
es: Nombre del paquete:
fr: Nom du paquet:
it: Nome pacchetto:
ja: パッケージ名:
ko: 패키지 이름:
ru: Имя пакета:
zh_cn: 包名:
zh_hant: 包名:

source: Version:
ar: الإصدار:
es: Versión:
it: Versione:
ja: バージョン:
ko: 버전:
ru: Версия:
zh_cn: 版本:
zh_hant: 版本:

source: Version sn:
ar: رقم الإصدار:
de: Versionsnummer:
es: Número de versión:
fr: Numéro de version:
it: Numero versione:
ja: バージョン番号:
ko: 버전 번호:
ru: Номер версии:
zh_cn: 版本号:
zh_hant: 版本號:

# icp_number
source: APP ICP number:
ar: رقم ICP للتطبيق:
de: APP ICP-Nummer:
es: Número ICP de la app:
fr: Numéro ICP de l'app:
it: Numero ICP app:
ja: APP ICP番号:
ko: APP ICP 번호:
ru: APP ICP номер:
zh_cn: APP备案号:
zh_hant: APP備案號:

source: Online feedback
ar: ملاحظات عبر الإنترنت
es: Comentarios en línea
fr: Commentaires en ligne
it: Feedback online
ja: オンラインフィードバック
ko: 온라인 피드백
ru: Онлайн-обратная связь
zh_cn: 在线反馈
zh_hant: 在線反饋

source: App info
ar: معلومات التطبيق
de: App-Informationen
es: Información de la app
fr: Informations de l'app
it: Info app
ja: アプリ情報
ko: 앱 정보
ru: Информация о приложении
zh_cn: APP信息
zh_hant: APP信息
