Repository: OpenIoTHub/OpenIoTHub
Catalog: packages/openiothub_common_pages/lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ja, ko, ru, zh_cn, zh_hant

# share_app_title
source: OpenIoTHub's internal network penetration and smart home management
ar: اختراق الشبكة الداخلية لـ OpenIoTHub وإدارة المنزل الذكي
de: OpenIoTHub's internes Netzwerk-Penetration und Smart-Home-Verwaltung
es: Penetración de red interna de OpenIoTHub y gestión del hogar inteligente
fr: Pénétration réseau interne d'OpenIoTHub et gestion de la maison intelligente
it: Penetrazione rete interna OpenIoTHub e gestione casa intelligente
ja: OpenIoTHubの内部ネットワーク透過とスマートホーム管理
ko: OpenIoTHub의 내부 네트워크 침투 및 스마트 홈 관리
ru: Внутренняя сеть OpenIoTHub и управление умным домом
zh_cn: 云亿连内网穿透和智能家居管理
zh_hant: 雲億連內網穿透和智能家居管理

# share_app_description
source: OpenIoTHub manages all your smart devices and private clouds across the entire platform
ar: يدير OpenIoTHub جميع أجهزتك الذكية والسحابات الخاصة عبر المنصة بأكملها
de: OpenIoTHub verwaltet alle Ihre Smart-Geräte und Private Clouds plattformübergreifend
es: OpenIoTHub gestiona todos sus dispositivos inteligentes y nubes privadas en toda la plataforma
fr: OpenIoTHub gère tous vos appareils intelligents et clouds privés sur toute la plateforme
it: OpenIoTHub gestisce tutti i tuoi dispositivi intelligenti e cloud privati su tutta la piattaforma
ja: OpenIoTHubは、プラットフォーム全体でスマートデバイスとプライベートクラウドを管理します
ko: OpenIoTHub는 전체 플랫폼에서 모든 스마트 기기와 프라이빗 클라우드를 관리합니다
ru: OpenIoTHub управляет всеми вашими умными устройствами и частными облаками на всей платформе
zh_cn: 云亿连全平台管理您的所有智能设备和私有云
zh_hant: 雲億連全平台管理您的所有智能設備和私有雲

source: Share
ar: مشاركة
de: Teilen
es: Compartir
fr: Partager
it: Condividi
ja: 共有
ko: 공유
ru: Поделиться
zh_cn: 分享
zh_hant: 分享

# share_to_where
source: Choose the location for the demander to share
ar: اختر موقع المشاركة
de: Wählen Sie den Ort zum Teilen
es: Elegir el lugar para compartir
fr: Choisir l'endroit pour partager
it: Scegli il luogo per condividere
ja: 共有する場所を選択
ko: 공유할 위치 선택
ru: Выберите место для отправки
zh_cn: 选择需方分享的位置
zh_hant: 選擇需方分享的位置

source: WeChat not installed
ar: WeChat غير مثبت
de: WeChat nicht installiert
es: WeChat no instalado
fr: WeChat non installé
it: WeChat non installato
ja: WeChatがインストールされていません
ko: WeChat이 설치되지 않음
ru: WeChat не установлен
zh_cn: 微信未安装
zh_hant: 微信未安裝

source: Share on Moments
ar: مشاركة على Moments
de: In Moments teilen
es: Compartir en Moments
fr: Partager sur Moments
it: Condividi su Moments
ja: Momentsで共有
ko: Moments에서 공유
ru: Поделиться в Moments
zh_cn: 分享到朋友圈
zh_hant: 分享到朋友圈

# find_local_gateway_list
source: Discover local gateway list
ar: اكتشاف قائمة البوابات المحلية
de: Lokale Gateway-Liste finden
es: Descubrir lista de puertas de enlace locales
fr: Découvrir la liste des passerelles locales
it: Scopri lista gateway locali
ja: ローカルゲートウェイリストを検出
ko: 로컬 게이트웨이 목록 검색
ru: Найти список локальных шлюзов
zh_cn: 发现本地网关列表
zh_hant: 發現本地網關列表

# manually_create_a_gateway
source: Manually creating a gateway?
ar: إنشاء بوابة يدوياً؟
de: Gateway manuell erstellen?
es: ¿Crear una puerta de enlace manualmente?
fr: Créer une passerelle manuellement?
it: Creare un gateway manualmente?
ja: ゲートウェイを手動で作成しますか？
ko: 게이트웨이를 수동으로 생성하시겠습니까?
ru: Создать шлюз вручную?
zh_cn: 手动创建一个网关？
zh_hant: 手動創建一個網關？

# manually_create_a_gateway_description1
source: The installed gateway can be found on this page
ar: يمكن العثور على البوابة المثبتة في هذه الصفحة
de: Das installierte Gateway kann auf dieser Seite gefunden werden
es: La puerta de enlace instalada se puede encontrar en esta página
fr: La passerelle installée peut être trouvée sur cette page
it: Il gateway installato può essere trovato in questa pagina
ja: インストールされたゲートウェイはこのページで見つけることができます
ko: 설치된 게이트웨이는 이 페이지에서 찾을 수 있습니다
ru: Установленный шлюз можно найти на этой странице
zh_cn: 安装的网关可以本页面发现
zh_hant: 安裝的網關可以本頁面發現

# manually_create_a_gateway_description2
source: Automatically generate a gateway information and fill it into the gateway configuration file with the token, suitable for situations where the mobile phone cannot discover the gateway on the local area network
ar: إنشاء معلومات البوابة تلقائياً وملؤها في ملف تكوين البوابة مع الرمز المميز، مناسب للحالات التي لا يمكن فيها للهاتف اكتشاف البوابة على الشبكة المحلية
de: Gateway-Informationen automatisch generieren und mit Token in die Konfigurationsdatei einfügen, geeignet wenn das Handy das Gateway im LAN nicht finden kann
es: Generar automáticamente información de la puerta de enlace y rellenarla en el archivo de configuración con el token, adecuado cuando el teléfono no puede descubrir la puerta de enlace en la red local
fr: Générer automatiquement les informations de la passerelle et les remplir dans le fichier de configuration avec le token, adapté lorsque le téléphone ne peut pas découvrir la passerelle sur le réseau local
it: Genera automaticamente informazioni gateway e riempile nel file di configurazione gateway con il token, adatto quando il telefono non può scoprire il gateway nella rete locale
ja: ゲートウェイ情報を自動生成し、トークンとともにゲートウェイ設定ファイルに記入します。携帯電話がローカルエリアネットワークでゲートウェイを検出できない場合に適しています
ko: 게이트웨이 정보를 자동으로 생성하고 토큰과 함께 게이트웨이 구성 파일에 채웁니다. 휴대폰이 로컬 영역 네트워크에서 게이트웨이를 검색할 수 없는 상황에 적합합니다
ru: Автоматически сгенерировать информацию о шлюзе и заполнить её в файл конфигурации шлюза с токеном, подходит для ситуаций, когда телефон не может обнаружить шлюз в локальной сети
zh_cn: 自动生成一个网关信息，回头拿着token填写到网关配置文件即可，适合于手机无法同局域网发现网关的情况
zh_hant: 自動生成一個網關信息，回頭拿著token填寫到網關配置文件即可，適合於手機無法同局域網發現網關的情況

# manually_create_a_gateway_description3
source: Select the server that the gateway needs to connect to from below:
ar: اختر الخادم الذي تحتاج البوابة للاتصال به من أدناه:
de: Wählen Sie den Server aus, mit dem das Gateway verbunden werden soll:
es: Seleccione el servidor al que la puerta de enlace necesita conectarse:
fr: Sélectionnez le serveur auquel la passerelle doit se connecter:
it: Seleziona il server a cui il gateway deve connettersi:
ja: ゲートウェイが接続する必要があるサーバーを以下から選択してください:
ko: 게이트웨이가 연결해야 하는 서버를 아래에서 선택하세요:
ru: Выберите сервер, к которому нужно подключить шлюз:
zh_cn: 从下面选择网关需要连接的服务器:
zh_hant: 從下面選擇網關需要連接的服務器:

source: Add
ar: إضافة
de: Hinzufügen
es: Añadir
fr: Ajouter
it: Aggiungi
ja: 追加
ko: 추가
ru: Добавить
zh_cn: 添加
zh_hant: 添加

# paste_info
source: The ID and token of the gateway have been copied to the clipboard. Please fill in the configuration of the clipboard in the gateway's configuration file
ar: تم نسخ معرف البوابة والرمز المميز إلى الحافظة. يرجى ملء تكوين الحافظة في ملف تكوين البوابة
de: ID und Token wurden in die Zwischenablage kopiert. Fügen Sie die Konfiguration in die Gateway-Konfigurationsdatei ein
es: El ID y el token de la puerta de enlace se han copiado al portapapeles. Rellene la configuración del portapapeles en el archivo de configuración de la puerta de enlace
fr: L'ID et le token de la passerelle ont été copiés dans le presse-papiers. Remplissez la configuration du presse-papiers dans le fichier de configuration de la passerelle
it: ID e token del gateway sono stati copiati negli appunti. Riempi la configurazione degli appunti nel file di configurazione del gateway
ja: ゲートウェイのIDとトークンがクリップボードにコピーされました。ゲートウェイの設定ファイルにクリップボードの設定を記入してください
ko: 게이트웨이의 ID와 토큰이 클립보드에 복사되었습니다. 게이트웨이 구성 파일에 클립보드의 구성을 입력하세요
ru: ID и токен шлюза скопированы в буфер обмена. Заполните конфигурацию из буфера обмена в файл конфигурации шлюза
zh_cn: 网关的id与token已经复制到剪切板，请将剪切板的配置填写到网关的配置文件中
zh_hant: 網關的id與token已經復制到剪切板，請將剪切板的配置填寫到網關的配置文件中

# add_gateway_success
source: The ID and token of the gateway have been copied to the clipboard. Please fill in the configuration of the clipboard in the gateway's configuration file
ar: تم نسخ معرف البوابة والرمز المميز إلى الحافظة. يرجى ملء تكوين الحافظة في ملف تكوين البوابة
de: ID und Token wurden in die Zwischenablage kopiert. Fügen Sie die Konfiguration in die Gateway-Konfigurationsdatei ein
es: El ID y el token de la puerta de enlace se han copiado al portapapeles. Rellene la configuración del portapapeles en el archivo de configuración de la puerta de enlace
fr: L'ID et le token de la passerelle ont été copiés dans le presse-papiers. Remplissez la configuration du presse-papiers dans le fichier de configuration de la passerelle
it: ID e token del gateway sono stati copiati negli appunti. Riempi la configurazione degli appunti nel file di configurazione del gateway
ja: ゲートウェイのIDとトークンがクリップボードにコピーされました。ゲートウェイの設定ファイルにクリップボードの設定を記入してください
ko: 게이트웨이의 ID와 토큰이 클립보드에 복사되었습니다. 게이트웨이 구성 파일에 클립보드의 구성을 입력하세요
ru: ID и токен шлюза скопированы в буфер обмена. Заполните конфигурацию из буфера обмена в файл конфигурации шлюза
zh_cn: 网关的id与token已经复制到剪切板，请将剪切板的配置填写到网关的配置文件中
zh_hant: 網關的id與token已經復制到剪切板，請將剪切板的配置填寫到網關的配置文件中

# gateway_install_guide
source: Gateway Installation Guide
ar: دليل تثبيت البوابة
de: Gateway-Installationsanleitung
es: Guía de instalación de puerta de enlace
fr: Guide d'installation de la passerelle
it: Guida installazione gateway
ja: ゲートウェイインストールガイド
ko: 게이트웨이 설치 가이드
ru: Руководство по установке шлюза
zh_cn: 网关安装指南
zh_hant: 網關安裝指南

# gateway_install_guide_content1
source: Here's how to install your own gateway
ar: إليك كيفية تثبيت بوابة خاصة بك
de: So installieren Sie Ihr eigenes Gateway
es: Así es como instalar su propia puerta de enlace
fr: Voici comment installer votre propre passerelle
it: Ecco come installare il tuo gateway
ja: 独自のゲートウェイをインストールする方法
ko: 자신의 게이트웨이를 설치하는 방법
ru: Вот как установить свой собственный шлюз
zh_cn: 这里介绍怎样安装一个自己的网关
zh_hant: 這裏介紹怎樣安裝一個自己的網關

# gateway_install_guide_content2
source: Firstly, you need to install the gateway to the local area network you need to access and keep it running continuously
ar: أولاً، تحتاج إلى تثبيت البوابة على الشبكة المحلية التي تحتاج للوصول إليها والحفاظ على تشغيلها باستمرار
de: Zuerst müssen Sie das Gateway im lokalen Netzwerk installieren und es kontinuierlich laufen lassen
es: Primero, necesita instalar la puerta de enlace en la red local a la que necesita acceder y mantenerla funcionando continuamente
fr: D'abord, vous devez installer la passerelle sur le réseau local auquel vous devez accéder et la maintenir en fonctionnement continu
it: Prima, devi installare il gateway nella rete locale a cui devi accedere e mantenerlo in esecuzione continuamente
ja: まず、アクセスする必要があるローカルエリアネットワークにゲートウェイをインストールし、継続的に実行し続ける必要があります
ko: 먼저 액세스해야 하는 로컬 영역 네트워크에 게이트웨이를 설치하고 계속 실행 상태로 유지해야 합니다
ru: Сначала вам нужно установить шлюз в локальную сеть, к которой нужно получить доступ, и поддерживать его работу непрерывно
zh_cn: 首先，你需要将网关安装到你需要访问的局域网持续运行
zh_hant: 首先，你需要將網關安裝到你需要訪問的局域網持續運行

# gateway_install_guide_content3
source: On the first attempt, connect this app to the local area network where the gateway is located
ar: في المحاولة الأولى، قم بتوصيل هذا التطبيق بالشبكة المحلية حيث توجد البوابة
de: Beim ersten Versuch verbinden Sie diese App mit dem lokalen Netzwerk, in dem sich das Gateway befindet
es: En el primer intento, conecte esta app a la red local donde se encuentra la puerta de enlace
fr: Lors de la première tentative, connectez cette app au réseau local où se trouve la passerelle
it: Al primo tentativo, connetti questa app alla rete locale dove si trova il gateway
ja: 最初の試行では、このアプリをゲートウェイが配置されているローカルエリアネットワークに接続します
ko: 첫 번째 시도에서 이 앱을 게이트웨이가 있는 로컬 영역 네트워크에 연결하세요
ru: При первой попытке подключите это приложение к локальной сети, где находится шлюз
zh_cn: 第一次的时候，将本APP也接入网关所在的局域网
zh_hant: 第一次的時候，將本APP也接入網關所在的局域網

# gateway_install_guide_content4
source: After searching and configuring the gateway on the local area network, the APP adds it once
ar: بعد البحث وتكوين البوابة على الشبكة المحلية، يضيف التطبيق البوابة مرة واحدة
de: Nach der Suche und Konfiguration fügt die App das Gateway einmal hinzu
es: Después de buscar y configurar la puerta de enlace en la red local, la app la añade una vez
fr: Après avoir recherché et configuré la passerelle sur le réseau local, l'app l'ajoute une fois
it: Dopo aver cercato e configurato il gateway nella rete locale, l'app lo aggiunge una volta
ja: ローカルエリアネットワークでゲートウェイを検索して設定した後、アプリは一度追加します
ko: 로컬 영역 네트워크에서 게이트웨이를 검색하고 구성한 후 앱이 한 번 추가합니다
ru: После поиска и настройки шлюза в локальной сети приложение добавляет его один раз
zh_cn: APP在局域网搜索并配置添加网关一次后
zh_hant: APP在局域網搜索並配置添加網關一次後

# gateway_install_guide_content5
source: In the future, as long as the gateway is online, the mobile client can access it
ar: في المستقبل، طالما أن البوابة متصلة، يمكن للعميل المحمول الوصول إليها
de: Solange das Gateway online ist, kann der mobile Client darauf zugreifen
es: En el futuro, siempre que la puerta de enlace esté en línea, el cliente móvil puede acceder a ella
fr: À l'avenir, tant que la passerelle est en ligne, le client mobile peut y accéder
it: In futuro, finché il gateway è online, il client mobile può accedervi
ja: 今後、ゲートウェイがオンラインである限り、モバイルクライアントはそれにアクセスできます
ko: 앞으로 게이트웨이가 온라인 상태인 한 모바일 클라이언트가 액세스할 수 있습니다
ru: В будущем, пока шлюз онлайн, мобильный клиент может получить к нему доступ
zh_cn: 以后只要网关在线手机客户端都可以访问
zh_hant: 以後只要網關在線手機客戶端都可以訪問

# gateway_install_guide_content6
source: Here is an introduction on how to install a gateway on the network you need to access
ar: إليك مقدمة حول كيفية تثبيت بوابة على الشبكة التي تحتاج للوصول إليها
de: Hier ist eine Anleitung zur Installation eines Gateways im Netzwerk
es: Aquí hay una introducción sobre cómo instalar una puerta de enlace en la red a la que necesita acceder
fr: Voici une introduction sur la façon d'installer une passerelle sur le réseau auquel vous devez accéder
it: Ecco un'introduzione su come installare un gateway nella rete a cui devi accedere
ja: アクセスする必要があるネットワークにゲートウェイをインストールする方法の紹介
ko: 액세스해야 하는 네트워크에 게이트웨이를 설치하는 방법 소개
ru: Вот введение о том, как установить шлюз в сети, к которой нужно получить доступ
zh_cn: 这里介绍如何在你所需要访问的网络安装网关
zh_hant: 這裏介紹如何在你所需要訪問的網絡安裝網關

# gateway_install_guide_content7
source: View the open source address of the gateway
ar: عرض عنوان المصدر المفتوح للبوابة
de: Open-Source-Adresse des Gateways anzeigen
es: Ver la dirección de código abierto de la puerta de enlace
fr: Voir l'adresse open source de la passerelle
it: Visualizza l'indirizzo open source del gateway
ja: ゲートウェイのオープンソースアドレスを表示
ko: 게이트웨이의 오픈 소스 주소 보기
ru: Просмотреть адрес открытого исходного кода шлюза
zh_cn: 查看网关的开源地址
zh_hant: 查看網關的開源地址

# gateway_install_guide_content8
source: OpenWRT router snapshot source installation: opkg install gateway-go
ar: تثبيت مصدر لقطة OpenWRT: opkg install gateway-go
de: OpenWRT Router Snapshot-Installation: opkg install gateway-go
es: Instalación desde snapshot de router OpenWRT: opkg install gateway-go
fr: Installation depuis snapshot OpenWRT: opkg install gateway-go
it: Installazione da snapshot router OpenWRT: opkg install gateway-go
ja: OpenWRTルータースナップショットソースインストール: opkg install gateway-go
ko: OpenWRT 라우터 스냅샷 소스 설치: opkg install gateway-go
ru: Установка из снимка OpenWRT роутера: opkg install gateway-go
zh_cn: openwrt路由器snapshot源安装：opkg install gateway-go
zh_hant: openwrt路由器snapshot源安裝：opkg install gateway-go

# gateway_install_guide_content9
source: MacOS installation using homebrew: brew install gateway-go
ar: تثبيت MacOS باستخدام Homebrew: brew install gateway-go
de: MacOS-Installation mit Homebrew: brew install gateway-go
es: Instalación MacOS usando Homebrew: brew install gateway-go
fr: Installation MacOS avec Homebrew: brew install gateway-go
it: Installazione MacOS con Homebrew: brew install gateway-go
ja: Homebrewを使用したMacOSインストール: brew install gateway-go
ko: Homebrew를 사용한 MacOS 설치: brew install gateway-go
ru: Установка MacOS с помощью Homebrew: brew install gateway-go
zh_cn: MacOS使用homebrew安装：brew install gateway-go
zh_hant: MacOS使用homebrew安裝：brew install gateway-go

# gateway_install_guide_content10
source: Linux installation using Snapcraft: sudo snap install gateway-go
ar: تثبيت Linux باستخدام Snapcraft: sudo snap install gateway-go
de: Linux-Installation mit Snapcraft: sudo snap install gateway-go
es: Instalación Linux usando Snapcraft: sudo snap install gateway-go
fr: Installation Linux avec Snapcraft: sudo snap install gateway-go
it: Installazione Linux con Snapcraft: sudo snap install gateway-go
ja: Snapcraftを使用したLinuxインストール: sudo snap install gateway-go
ko: Snapcraft를 사용한 Linux 설치: sudo snap install gateway-go
ru: Установка Linux с помощью Snapcraft: sudo snap install gateway-go
zh_cn: Linux使用snapcraft安装：sudo snap install gateway-go
zh_hant: Linux使用snapcraft安裝：sudo snap install gateway-go

source: Name
ar: الاسم
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
ru: Имя
zh_cn: 名称
zh_hant: 名稱

# define_server_name
source: Customize server name
ar: تخصيص اسم الخادم
de: Servernamen anpassen
es: Personalizar nombre del servidor
fr: Personnaliser le nom du serveur
it: Personalizza nome server
ja: サーバー名をカスタマイズ
ko: 서버 이름 사용자 지정
ru: Настроить имя сервера
zh_cn: 自定义服务器名称
zh_hant: 自定義服務器名稱

# define_server_ip_or_domain
source: Server IP address or domain name
ar: عنوان IP للخادم أو اسم النطاق
de: Server-IP-Adresse oder Domänenname
es: Dirección IP del servidor o nombre de dominio
fr: Adresse IP du serveur ou nom de domaine
it: Indirizzo IP del server o nome dominio
ja: サーバーIPアドレスまたはドメイン名
ko: 서버 IP 주소 또는 도메인 이름
ru: IP-адрес сервера или доменное имя
zh_cn: 服务器ip地址或者域名
zh_hant: 服務器ip地址或者域名

# define_server_addr
source: The address of the public server go server
ar: عنوان الخادم العام go server
de: Die Adresse des öffentlichen Server-Go-Servers
es: La dirección del servidor público go server
fr: L'adresse du serveur public go server
it: L'indirizzo del server pubblico go server
ja: パブリックサーバーgoサーバーのアドレス
ko: 공개 서버 go 서버의 주소
ru: Адрес публичного сервера go server
zh_cn: 公网server-go服务器的地址
zh_hant: 公網server-go服務器的地址

# define_server_key
source: Key
ar: المفتاح
de: Schlüssel
es: Clave
fr: Clé
it: Chiave
ja: キー
ko: 키
ru: Ключ
zh_cn: 秘钥
zh_hant: 秘鑰

# define_server_tcp_port
source: Tcp port
ar: منفذ TCP
es: Puerto TCP
fr: Port TCP
it: Porta TCP
ja: TCPポート
ko: TCP 포트
ru: TCP-порт
zh_cn: tcp端口
zh_hant: tcp端口

# define_server_kcp_port
source: Kcp port
ar: منفذ KCP
es: Puerto KCP
fr: Port KCP
it: Porta KCP
ja: KCPポート
ko: KCP 포트
ru: KCP-порт
zh_cn: kcp端口
zh_hant: kcp端口

source: Port
ar: المنفذ
es: Puerto
it: Porta
ja: ポート
ko: 포트
ru: Порт
zh_cn: 端口
zh_hant: 端口

source: Description
ar: الوصف
de: Beschreibung
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
ru: Описание
zh_cn: 描述
zh_hant: 描述

# define_description
source: Customize description information
ar: تخصيص معلومات الوصف
de: Beschreibungsinformationen anpassen
es: Personalizar información de descripción
fr: Personnaliser les informations de description
it: Personalizza informazioni descrizione
ja: 説明情報をカスタマイズ
ko: 설명 정보 사용자 지정
ru: Настроить информацию описания
zh_cn: 自定义描述信息
zh_hant: 自定義描述信息

# for_everyone_to_use
source: Provided to all users of the app for use:
ar: مقدم لجميع مستخدمي التطبيق للاستخدام:
de: Für alle App-Benutzer zur Verwendung bereitgestellt:
es: Proporcionado a todos los usuarios de la app para uso:
fr: Fourni à tous les utilisateurs de l'app pour utilisation:
it: Fornito a tutti gli utenti dell'app per uso:
ja: アプリのすべてのユーザーに提供:
ko: 앱의 모든 사용자에게 제공:
ru: Предоставлено всем пользователям приложения для использования:
zh_cn: 提供给APP所有人使用:
zh_hant: 提供給APP所有人使用:

# update_success
source: Update successful!
ar: تم التحديث بنجاح!
de: Update erfolgreich!
es: ¡Actualización exitosa!
fr: Mise à jour réussie!
it: Aggiornamento riuscito!
ja: 更新に成功しました！
ko: 업데이트 성공!
ru: Обновление успешно!
zh_cn: 更新成功！
zh_hant: 更新成功！

# confirm_modify
source: Confirm modification
ar: تأكيد التعديل
de: Änderung bestätigen
es: Confirmar modificación
fr: Confirmer la modification
it: Conferma modifica
ja: 変更を確認
ko: 수정 확인
ru: Подтвердить изменение
zh_cn: 确认修改
zh_hant: 確認修改

# server_info
source: Server information
ar: معلومات الخادم
de: Serverinformationen
es: Información del servidor
fr: Informations du serveur
it: Informazioni server
ja: サーバー情報
ko: 서버 정보
ru: Информация о сервере
zh_cn: 服务器信息
zh_hant: 服務器信息

# delete_success
source: Delete successfully！
ar: تم الحذف بنجاح！
de: Erfolgreich gelöscht！
es: ¡Eliminado exitosamente！
fr: Supprimé avec succès！
it: Eliminato con successo！
ja: 削除に成功しました！
ko: 삭제 성공！
ru: Удалено успешно！
zh_cn: 删除成功！
zh_hant: 刪除成功！

# grpc_server_addr
source: Address of grpc service
ar: عنوان خدمة gRPC
de: Adresse des gRPC-Service
es: Dirección del servicio gRPC
fr: Adresse du service gRPC
it: Indirizzo del servizio gRPC
ja: gRPCサービスのアドレス
ko: gRPC 서비스 주소
ru: Адрес службы gRPC
zh_cn: grpc服务的地址
zh_hant: grpc服務的地址

# grpc_server_ip_or_domain
source: Please enter the IP or domain name of the grpc service
ar: أدخل عنوان IP أو اسم النطاق لخدمة gRPC
de: Bitte geben Sie die IP oder den Domänennamen des gRPC-Service ein
es: Introduzca la IP o el nombre de dominio del servicio gRPC
fr: Veuillez entrer l'IP ou le nom de domaine du service gRPC
it: Inserisci l'IP o il nome dominio del servizio gRPC
ja: gRPCサービスのIPまたはドメイン名を入力してください
ko: gRPC 서비스의 IP 또는 도메인 이름을 입력하세요
ru: Введите IP или доменное имя службы gRPC
zh_cn: 请输入grpc服务的IP或者域名
zh_hant: 請輸入grpc服務的IP或者域名

# grpc_service_port
source: Port for grpc service
ar: منفذ خدمة gRPC
de: Port für gRPC-Service
es: Puerto para el servicio gRPC
fr: Port pour le service gRPC
it: Porta per il servizio gRPC
ja: gRPCサービスのポート
ko: gRPC 서비스 포트
ru: Порт для службы gRPC
zh_cn: grpc服务的端口
zh_hant: grpc服務的端口

# input_grpc_service_port
source: Please enter the port of the grpc service
ar: أدخل منفذ خدمة gRPC
de: Bitte geben Sie den Port des gRPC-Service ein
es: Introduzca el puerto del servicio gRPC
fr: Veuillez entrer le port du service gRPC
it: Inserisci la porta del servizio gRPC
ja: gRPCサービスのポートを入力してください
ko: gRPC 서비스의 포트를 입력하세요
ru: Введите порт службы gRPC
zh_cn: 请输入grpc服务的端口
zh_hant: 請輸入grpc服務的端口

source: iot-manager addr
ar: عنوان مدير IoT
de: IoT-Manager-Adresse
es: Dirección del gestor IoT
fr: Adresse du gestionnaire IoT
it: Indirizzo gestore IoT
ja: IoTマネージャーアドレス
ko: IoT 관리자 주소
ru: Адрес менеджера IoT
zh_cn: iot-manager地址
zh_hant: iot-manager地址

# input_iot_manager_addr
source: Please enter the iot_manager GRPC service address
ar: أدخل عنوان خدمة GRPC لمدير IoT
de: Bitte geben Sie die gRPC-Service-Adresse des IoT-Managers ein
es: Introduzca la dirección del servicio GRPC del gestor IoT
fr: Veuillez entrer l'adresse du service GRPC du gestionnaire IoT
it: Inserisci l'indirizzo del servizio GRPC del gestore IoT
ja: iot_manager GRPCサービスアドレスを入力してください
ko: iot_manager GRPC 서비스 주소를 입력하세요
ru: Введите адрес службы GRPC менеджера IoT
zh_cn: 请输入iot-manager grpc服务地址
zh_hant: 請輸入iot-manager grpc服務地址

# activate_front_desk_service
source: Android background service keep alive
ar: الحفاظ على خدمة الخلفية Android نشطة
de: Android-Hintergrunddienst am Leben halten
es: Mantener vivo el servicio en segundo plano de Android
fr: Maintenir en vie le service en arrière-plan Android
it: Mantieni attivo il servizio in background Android
ja: Androidバックグラウンドサービスを維持
ko: Android 백그라운드 서비스 유지
ru: Поддерживать работу фоновой службы Android
zh_cn: 开启前台服务(后台保活)
zh_hant: 開啟前臺服務

# auto_start_gateway
source: Auto start gateway when APP started
ar: بدء البوابة تلقائياً عند بدء التطبيق
de: Gateway beim App-Start automatisch starten
es: Iniciar automáticamente el gateway cuando se inicie la APP
fr: Démarrer automatiquement la passerelle au démarrage de l'APP
it: Avvia automaticamente il gateway all'avvio dell'APP
ja: APP起動時にゲートウェイを自動起動
ko: APP 시작 시 게이트웨이 자동 시작
ru: Автоматически запускать шлюз при запуске приложения

source: Wake lock enabled
ar: تم تفعيل Wake lock
de: Wake Lock aktiviert
es: Wake lock habilitado
fr: Wake lock activé
it: Wake lock abilitato
ja: Wake lock有効
ko: Wake lock 활성화
ru: Wake lock включён

# my_server_description_example
source: My own server-go server
ar: خادم server-go الخاص بي
de: Mein eigener Server-Go-Server
es: Mi propio servidor server-go
fr: Mon propre serveur server-go
it: Il mio server server-go
ja: 自分のserver-goサーバー
ko: 내 server-go 서버
ru: Мой собственный сервер server-go
zh_cn: 我自己的server-go服务器
zh_hant: 我自己的server-go服務器
