Repository: OpenIoTHub/OpenIoTHub
Catalog: packages/openiothub_common_pages/lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ja, ko, ru, zh_cn, zh_hant

# my_server_description
source: Description of my server
ar: وصف خادمي
de: Beschreibung meines Servers
es: Descripción de mi servidor
fr: Description de mon serveur
it: Descrizione del mio server
ja: 自分のサーバーの説明
ko: 내 서버 설명
ru: Описание моего сервера
zh_cn: 我的服务器的描述
zh_hant: 我的服務器的描述

# add_self_hosted_server
source: Add self built server:
ar: إضافة خادم مبنى ذاتياً:
de: Selbst gebauten Server hinzufügen:
es: Añadir servidor autoconstruido:
fr: Ajouter un serveur auto-construit:
it: Aggiungi server auto-costruito:
ja: 自己構築サーバーを追加:
ko: 자체 구축 서버 추가:
ru: Добавить самостоятельно построенный сервер:
zh_cn: 添加自建服务器：
zh_hant: 添加自建服務器：

source: Server uuid
ar: UUID الخادم
es: UUID del servidor
fr: UUID du serveur
it: UUID server
ja: サーバーUUID
ko: 서버 UUID
ru: UUID сервера
zh_cn: 服务器uuid
zh_hant: 服務器uuid

# as_config_file
source: Consistent with the configuration files in the server-go server
ar: متسق مع ملفات التكوين في خادم server-go
de: Konsistent mit den Konfigurationsdateien im Server-Go-Server
es: Consistente con los archivos de configuración en el servidor server-go
fr: Cohérent avec les fichiers de configuration dans le serveur server-go
it: Coerente con i file di configurazione nel server server-go
ja: server-goサーバーの設定ファイルと一致
ko: server-go 서버의 구성 파일과 일치
ru: Согласовано с файлами конфигурации в сервере server-go
zh_cn: 跟server-go服务器里面的配置文件一致
zh_hant: 跟server-go服務器裏面的配置文件一致

source: Add to server
ar: إضافة إلى الخادم
de: Zum Server hinzufügen
es: Añadir al servidor
fr: Ajouter au serveur
it: Aggiungi al server
ja: サーバーに追加
ko: 서버에 추가
ru: Добавить на сервер
zh_cn: 添加到服务器
zh_hant: 添加到服務器

source: Add server
ar: إضافة خادم
de: Server hinzufügen
es: Añadir servidor
fr: Ajouter un serveur
it: Aggiungi server
ja: サーバーを追加
ko: 서버 추가
ru: Добавить сервер
zh_cn: 添加服务器
zh_hant: 添加服務器

source: Success!
ar: نجح!
de: Erfolg!
es: ¡Éxito!
fr: Succès!
it: Successo!
ja: 成功！
ko: 성공!
ru: Успех!
zh_cn: 成功!
zh_hant: 成功!

# location_req_name
source: Request location permission
ar: طلب إذن الموقع
de: Standortberechtigung anfordern
es: Solicitar permiso de ubicación
fr: Demander la permission de localisation
it: Richiedi permesso posizione
ja: 位置情報権限をリクエスト
ko: 위치 권한 요청
ru: Запросить разрешение на местоположение
zh_cn: 申请位置权限说明
zh_hant: 申請位置權限說明

# location_req_desc
source: Apply for location permission to obtain WiFi information for smart device distribution network
ar: التقدم بطلب للحصول على إذن الموقع للحصول على معلومات WiFi لشبكة توزيع الأجهزة الذكية
de: Standortberechtigung beantragen, um WiFi-Informationen für Smart-Geräte-Netzwerkverteilung zu erhalten
es: Solicitar permiso de ubicación para obtener información WiFi para la distribución de red de dispositivos inteligentes
fr: Demander la permission de localisation pour obtenir les informations WiFi pour la distribution réseau des appareils intelligents
it: Richiedi permesso posizione per ottenere informazioni WiFi per la distribuzione rete dispositivi intelligenti
ja: スマートデバイス配布ネットワークのWiFi情報を取得するために位置情報権限を申請
ko: 스마트 기기 배포 네트워크의 WiFi 정보를 얻기 위해 위치 권한 신청
ru: Подать заявку на разрешение местоположения для получения информации WiFi для сети распределения умных устройств
zh_cn: 申请位置权限，以获取WiFi信息用于智能设备配网
zh_hant: 申請位置權限，以獲取WiFi信息用於智能設備配網

# confirm_add_gateway
source: Are you sure to add a gateway?
ar: هل أنت متأكد من إضافة بوابة؟
de: Gateway wirklich hinzufügen?
es: ¿Añadir una puerta de enlace?
fr: Ajouter une passerelle?
it: Aggiungere un gateway?
ja: ゲートウェイを追加してもよろしいですか？
ko: 게이트웨이를 추가하시겠습니까?
ru: Добавить шлюз?
zh_cn: 确认添加次网关到账户？
zh_hant: 確認添加網關到本賬號？

# github_repo
source: Github Repository
ar: مستودع GitHub
es: Repositorio GitHub
fr: Dépôt GitHub
it: Repository GitHub
ja: GitHubリポジトリ
ko: GitHub 저장소
ru: Репозиторий GitHub

# app_title
source: OpenIoTHub
zh_cn: 云亿连
zh_hant: 雲億連

source: WiFi SSID
zh_cn: WiFi名称
zh_hant: WiFi名稱

# server_go_addr_example
source: usa.servers.iothub.cloud
zh_cn: guonei.servers.iothub.cloud
zh_hant: guonei.servers.iothub.cloud
