Repository: OpenIoTHub/OpenIoTHub
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ja, ko, ru, zh_hans, zh_hant

# app_title
source: OpenIoTHub
zh_hans: 云亿连
zh_hant: 雲億連

# tab_smart
source: Smart
ja: スマート
ko: 스마트
zh_hans: 智能
zh_hant: 智能

# tab_gateway
source: Gateway
ar: البوابة
es: Puerta de enlace
fr: Passerelle
ja: ゲートウェイ
ko: 게이트웨이
ru: Шлюз
zh_hans: 网关
zh_hant: 網關

# tab_host
source: Host
ar: المضيف
fr: Hôte
ja: ホスト
ko: 호스트
ru: Хост
zh_hans: 主机
zh_hant: 主機

# tab_user
source: Me
ar: أنا
de: Ich
es: Yo
fr: Moi
it: Io
ja: 私
ko: 나
ru: Я
zh_hans: 我
zh_hant: 我

# profile_not_logged_in
source: Not logged in
ar: غير مسجل الدخول
de: Nicht angemeldet
es: No iniciado
fr: Non connecté
it: Non connesso
ja: ログインしていません
ko: 로그인하지 않음
ru: Не вошли
zh_hans: 未登录
zh_hant: 未登錄

# profile_click_avatar_to_sign_in
source: Click avatar to sign in
ar: انقر على الصورة لتسجيل الدخول
de: Avatar zum Anmelden klicken
es: Toca el avatar para iniciar sesión
fr: Touchez l'avatar pour vous connecter
it: Tocca l'avatar per accedere
ja: アバターをクリックしてログイン
ko: 아바타를 클릭하여 로그인
ru: Нажмите на аватар для входа
zh_hans: 点击头像登录
zh_hant: 點擊頭像登錄

# profile_settings
source: Settings
ar: الإعدادات
de: Einstellungen
es: Configuración
fr: Paramètres
it: Impostazioni
ja: 設定
ko: 설정
ru: Настройки
zh_hans: 设置
zh_hant: 設置

# profile_servers
source: My Servers
ar: خوادمي
de: Meine Server
es: Mis Servidores
fr: Mes Serveurs
it: I Miei Server
ja: マイサーバー
ko: 내 서버
ru: Мои Серверы
zh_hans: 我的服务器
zh_hant: 我的服務器

# profile_tools
source: Tools
ar: أدوات
de: Werkzeuge
es: Herramientas
fr: Outils
it: Strumenti
ja: ツール
ko: 도구
ru: Инструменты
zh_hans: 工具
zh_hant: 工具

# profile_docs
source: Docs
ar: وثائق
de: Dokumentation
es: Documentación
fr: Documentation
it: Documentazione
ja: ドキュメント
ko: 문서
ru: Документация
zh_hans: 文档
zh_hant: 文檔

# profile_video_tutorials
source: Video Tutorials
ar: دروس فيديو
es: Tutoriales en Video
fr: Tutoriels Vidéo
it: Tutorial Video
ja: ビデオチュートリアル
ko: 비디오 튜토리얼
ru: Видеоуроки
zh_hans: 视频教程
zh_hant: 視頻教程

# profile_feedback
source: feedback
ar: تعليقات
es: Comentarios
fr: Commentaires
ja: フィードバック
ko: 피드백
ru: Обратная связь
zh_hans: 反馈和建议
zh_hant: 反饋和建議

source: App Local Gateway
ar: بوابة التطبيق المحلية
de: App-Lokales Gateway
es: Puerta de Enlace Local de la App
fr: Passerelle Locale de l'App
it: Gateway Locale App
ja: アプリローカルゲートウェイ
ko: 앱 로컬 게이트웨이
ru: Локальный шлюз приложения
zh_hans: 本机网关
zh_hant: 本機網關

# profile_about_this_app
source: About this App
ar: حول هذا التطبيق
de: Über diese App
es: Acerca de esta App
fr: À propos de cette App
it: Informazioni su questa App
ja: このアプリについて
ko: 이 앱 정보
ru: О приложении
zh_hans: 关于本软件
zh_hant: 關於本軟件

source: Config Device WiFi
ar: إعدادات WiFi للجهاز
de: Geräte-WiFi konfigurieren
es: Configurar WiFi del dispositivo
fr: Configurer WiFi de l'appareil
it: Configura WiFi dispositivo
ja: デバイスWiFi設定
ko: 기기 WiFi 설정
ru: Настройка WiFi устройства
zh_hans: 配置设备WiFi
zh_hant: 配置設備WiFi

# scan_QR
source: Scan QR(recommend)
ar: مسح QR (موصى به)
de: QR scannen (empfohlen)
es: Escanear QR (recomendado)
fr: Scanner QR (recommandé)
it: Scansiona QR (consigliato)
ja: QRコードをスキャン（推奨）
ko: QR 코드 스캔（권장）
ru: Сканировать QR (рекомендуется)
zh_hans: 扫描二维码
zh_hant: 掃描二維碼

source: Find Local Gateway
ar: البحث عن البوابة المحلية
de: Lokales Gateway finden
es: Buscar puerta de enlace local
fr: Trouver la passerelle locale
it: Trova gateway locale
ja: ローカルゲートウェイを検索
ko: 로컬 게이트웨이 찾기
ru: Найти локальный шлюз
zh_hans: 发现局域网网关
zh_hant: 發現局域網網關

source: Add Remote Host
ar: إضافة مضيف بعيد
de: Remote-Host hinzufügen
es: Añadir host remoto
fr: Ajouter un hôte distant
it: Aggiungi host remoto
ja: リモートホストを追加
ko: 원격 호스트 추가
ru: Добавить удалённый хост
zh_hans: 添加远程主机
zh_hant: 添加遠程主機

source: I also have a bottom line
de: Ich habe auch eine Grundlinie
es: También tengo una línea base
fr: J'ai aussi une ligne de base
it: Ho anche una linea di base
zh_hans: 我也是有底线的
zh_hant: 我也是有底線的

# ftp_port_list_title
source: FTP port list
de: FTP-Portliste
es: Lista de puertos FTP
fr: Liste des ports FTP
it: Elenco porte FTP
ja: FTPポートリスト
ko: FTP 포트 목록
zh_hans: FTP端口列表
zh_hant: FTP端口列表

source: Remote port
ar: منفذ بعيد
es: Puerto remoto
fr: Port distant
it: Porta remota
ja: リモートポート
ko: 원격 포트
ru: Удалённый порт
zh_hans: 远程端口
zh_hant: 遠程端口

source: Local port
ar: منفذ محلي
de: Lokaler Port
es: Puerto local
fr: Port local
it: Porta locale
ja: ローカルポート
ko: 로컬 포트
ru: Локальный порт
zh_hans: 映射到本机端口
zh_hant: 映射到本機端口

source: Description
ar: الوصف
de: Beschreibung
es: Descripción
it: Descrizione
ja: 説明
ko: 설명
ru: Описание
zh_hans: 描述
zh_hant: 描述

source: Forwarding connection status
ar: حالة اتصال التوجيه
de: Weiterleitungsverbindungsstatus
es: Estado de conexión de reenvío
fr: Statut de connexion de transfert
it: Stato connessione inoltro
ja: 転送接続ステータス
ko: 전달 연결 상태
ru: Статус соединения переадресации
zh_hans: 转发连接状态
zh_hant: 轉發連接狀態

source: Online
ar: متصل
es: En línea
fr: En ligne
ja: オンライン
ko: 온라인
ru: В сети
zh_hans: 在线
zh_hant: 在線

source: Offline
ar: غير متصل
es: Desconectado
fr: Hors ligne
ja: オフライン
ko: 오프라인
ru: Не в сети
zh_hans: 离线
zh_hant: 離線

source: Port details
ar: تفاصيل المنفذ
es: Detalles del puerto
fr: Détails du port
it: Dettagli porta
ja: ポート詳細
ko: 포트 상세
ru: Детали порта
zh_hans: 端口详情
zh_hant: 端口詳情

# add_port
source: Add portï¼š
ar: إضافة منفذ：
de: Port hinzufügen：
es: Añadir puerto：
fr: Ajouter un port：
it: Aggiungi porta：
ja: ポートを追加：
ko: 포트 추가：
ru: Добавить порт：
zh_hans: 添加端口：
zh_hant: 添加端口：

source: Notes
ar: ملاحظات
de: Notizen
es: Notas
it: Note
ja: メモ
ko: 메모
ru: Заметки
zh_hans: 备注
zh_hant: 備註

source: Custom remarks
ar: ملاحظات مخصصة
de: Benutzerdefinierte Bemerkungen
es: Comentarios personalizados
fr: Remarques personnalisées
it: Osservazioni personalizzate
ja: カスタム備考
ko: 사용자 정의 비고
ru: Пользовательские примечания
zh_hans: 自定义备注
zh_hant: 自定義備註

source: Port number
ar: رقم المنفذ
de: Portnummer
es: Número de puerto
fr: Numéro de port
it: Numero porta
ja: ポート番号
ko: 포트 번호
ru: Номер порта
zh_hans: 端口号
zh_hant: 端口號

# the_port_number_of_this_machine
source: The remote port number
ar: رقم المنفذ البعيد
de: Die Remote-Portnummer
es: Número de puerto remoto
fr: Le numéro de port distant
it: Numero porta remota
ja: リモートポート番号
ko: 원격 포트 번호
ru: Номер удалённого порта
zh_hans: 该机器的端口号
zh_hant: 該機器的端口號

# map_to_the_port_number_of_this_mobile_phone
source: The local port number
ar: رقم المنفذ المحلي
de: Die lokale Portnummer
es: Número de puerto local
fr: Le numéro de port local
it: Numero porta locale
ja: ローカルポート番号
ko: 로컬 포트 번호
ru: Номер локального порта
zh_hans: 映射到本手机端口号(随机则填0)
zh_hant: 映射到本手機端口號(隨機則填0)

# this_phone_has_an_idle_port_number_of_1024_or_above
source: 0: random;1024 or above
ar: 0: عشوائي; 1024 أو أعلى
de: 0: zufällig; 1024 oder höher
es: 0: aleatorio; 1024 o superior
fr: 0: aléatoire; 1024 ou supérieur
it: 0: casuale; 1024 o superiore
ru: 0: случайный; 1024 или выше
zh_hans: 本手机1024以上空闲端口号
zh_hant: 本手機1024以上空閒端口號

source: Cancel
ar: إلغاء
de: Abbrechen
es: Cancelar
fr: Annuler
it: Annulla
ja: キャンセル
ko: 취소
ru: Отмена
zh_hans: 取消
zh_hant: 取消

source: Add
ar: إضافة
de: Hinzufügen
es: Añadir
fr: Ajouter
it: Aggiungi
ja: 追加
ko: 추가
ru: Добавить
zh_hans: 添加
zh_hant: 添加

source: Check if the port is a number
ar: تحقق من أن المنفذ رقم
de: Überprüfen Sie, ob der Port eine Zahl ist
es: Verifique si el puerto es un número
fr: Vérifiez si le port est un nombre
it: Verifica se la porta è un numero
ja: ポートが数値かどうかを確認してください
ko: 포트가 숫자인지 확인하세요
ru: Проверьте, является ли порт числом
zh_hans: 检查端口是否为数字
zh_hant: 檢查端口是否為數字

source: Delete FTP
ar: حذف FTP
de: FTP löschen
es: Eliminar FTP
fr: Supprimer FTP
it: Elimina FTP
ja: FTPを削除
ko: FTP 삭제
ru: Удалить FTP
zh_hans: 删除FTP
zh_hant: 刪除FTP

# confirm_to_delete_this_ftp
source: Are you sure to delete this FTP?
ar: حذف هذا FTP؟
de: Dieses FTP wirklich löschen?
es: ¿Eliminar este FTP?
fr: Supprimer ce FTP?
it: Eliminare questo FTP?
ja: このFTPを削除してもよろしいですか？
ko: 이 FTP를 삭제하시겠습니까?
ru: Удалить этот FTP?
zh_hans: 确认删除此FTP?
zh_hant: 確認刪除此FTP?

source: Delete
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
it: Elimina
ja: 削除
ko: 삭제
ru: Удалить
zh_hans: 删除
zh_hant: 刪除

# http_port_list_title
source: HTTP port list
ar: قائمة منافذ HTTP
de: HTTP-Portliste
es: Lista de puertos HTTP
fr: Liste des ports HTTP
it: Elenco porte HTTP
ja: HTTPポートリスト
ko: HTTP 포트 목록
ru: Список HTTP-портов
zh_hans: Http端口列表
zh_hant: Http端口列表

source: Domain
ar: النطاق
de: Domäne
es: Dominio
fr: Domaine
it: Dominio
ja: ドメイン
ko: 도메인
ru: Домен
zh_hans: 域名
zh_hant: 域名

source: Add port domain name:
ar: إضافة اسم نطاق المنفذ:
de: Port-Domänenname hinzufügen:
es: Añadir nombre de dominio del puerto:
fr: Ajouter le nom de domaine du port:
it: Aggiungi nome dominio porta:
ja: ポートドメイン名を追加：
ko: 포트 도메인 이름 추가：
ru: Добавить доменное имя порта:
zh_hans: 添加端口域名：
zh_hant: 添加端口域名：

source: Configure the domain name for this port
ar: تكوين اسم النطاق لهذا المنفذ
de: Domänenname für diesen Port konfigurieren
es: Configurar el nombre de dominio para este puerto
fr: Configurer le nom de domaine pour ce port
it: Configura il nome dominio per questa porta
ja: このポートのドメイン名を設定
ko: 이 포트의 도메인 이름 구성
ru: Настроить доменное имя для этого порта
zh_hans: 配置该端口的域名
zh_hant: 配置該端口的域名

source: Ports that need to be mapped
ar: المنافذ التي تحتاج إلى تعيين
de: Zu mappende Ports
es: Puertos que necesitan ser mapeados
fr: Ports à mapper
it: Porte da mappare
ja: マッピングが必要なポート
ko: 매핑이 필요한 포트
ru: Порты, которые нужно сопоставить
zh_hans: 需要映射的端口
zh_hant: 需要映射的端口

# delete_this_http
source: Delete HTTP
ar: حذف HTTP
de: HTTP löschen
es: Eliminar HTTP
fr: Supprimer HTTP
it: Elimina HTTP
ja: HTTPを削除
ko: HTTP 삭제
ru: Удалить HTTP
zh_hans: 删除Http
zh_hant: 刪除Http

source: Are you sure to delete this HTTP?
ar: حذف هذا HTTP؟
de: Dieses HTTP wirklich löschen?
es: ¿Eliminar este HTTP?
fr: Supprimer ce HTTP?
it: Eliminare questo HTTP?
ja: このHTTPを削除してもよろしいですか？
ko: 이 HTTP를 삭제하시겠습니까?
ru: Удалить этот HTTP?
zh_hans: 确认删除此Http？
zh_hant: 確認刪除此Http？

# tcp_port_list_title
source: TCP Port List
ar: قائمة منافذ TCP
de: TCP-Portliste
es: Lista de puertos TCP
fr: Liste des ports TCP
it: Elenco porte TCP
ja: TCPポートリスト
ko: TCP 포트 목록
ru: Список TCP-портов
zh_hans: TCP端口列表
zh_hant: TCP端口列表

source: Opening method:
ar: طريقة الفتح:
de: Öffnungsmethode:
es: Método de apertura:
fr: Méthode d'ouverture:
it: Metodo di apertura:
ja: 開く方法：
ko: 열기 방법：
ru: Метод открытия:
zh_hans: 打开方式：
zh_hant: 打開方式：

# my_tcp_port
source: My TCP
ar: TCP الخاص بي
de: Mein TCP
es: Mi TCP
fr: Mon TCP
it: Il mio TCP
ja: マイTCP
ko: 내 TCP
ru: Мой TCP
zh_hans: 我的TCP
zh_hant: 我的TCP

# the_port_number_that_the_remote_machine_needs_to_access
source: The remote machine port
ar: منفذ الجهاز البعيد
de: Der Port der Remote-Maschine
es: Puerto de la máquina remota
fr: Le port de la machine distante
it: La porta della macchina remota
ja: リモートマシンのポート
ko: 원격 머신 포트
ru: Порт удалённой машины
zh_hans: 远程机器需要访问的端口号
zh_hant: 遠程機器需要訪問的端口號

# domain_notes
source: For http public only
ar: لـ HTTP العام فقط
de: Nur für öffentliches HTTP
es: Solo para HTTP público
fr: Pour HTTP public uniquement
it: Solo per HTTP pubblico
ja: HTTP公開のみ
ko: HTTP 공개 전용
ru: Только для публичного HTTP
zh_hans: 不是网站端口请不要修改;不想映射到服务器请不要修改
zh_hant: 不是網站端口請不要修改;不想映射到服務器請不要修改

source: Delete TCP
ar: حذف TCP
de: TCP löschen
es: Eliminar TCP
fr: Supprimer TCP
it: Elimina TCP
ja: TCPを削除
ko: TCP 삭제
ru: Удалить TCP
zh_hans: 删除TCP
zh_hant: 刪除TCP

# confirm_to_delete_this_tcp
source: Are you sure to delete this TCP?
ar: حذف هذا TCP؟
de: Dieses TCP wirklich löschen?
es: ¿Eliminar este TCP?
fr: Supprimer ce TCP?
it: Eliminare questo TCP?
ja: このTCPを削除してもよろしいですか？
ko: 이 TCP를 삭제하시겠습니까?
ru: Удалить этот TCP?
zh_hans: 确认删除此TCP?
zh_hant: 確認刪除此TCP?

source: TCP Port
ar: منفذ TCP
es: Puerto TCP
fr: Port TCP
it: Porta TCP
ja: TCPポート
ko: TCP 포트
ru: TCP-порт
zh_hans: TCP端口
zh_hant: TCP端口

source: UDP Port
ar: منفذ UDP
es: Puerto UDP
fr: Port UDP
it: Porta UDP
ja: UDPポート
ko: UDP 포트
ru: UDP-порт
zh_hans: UDP端口
zh_hant: UDP端口

source: FTP Port
ar: منفذ FTP
es: Puerto FTP
fr: Port FTP
it: Porta FTP
ja: FTPポート
ko: FTP 포트
ru: FTP-порт
zh_hans: FTP端口
zh_hant: FTP端口

source: HTTP Port
ar: منفذ HTTP
es: Puerto HTTP
fr: Port HTTP
it: Porta HTTP
ja: HTTPポート
ko: HTTP 포트
ru: HTTP-порт
zh_hans: HTTP端口
zh_hant: HTTP端口

source: Service
ar: خدمة
de: Dienst
es: Servicio
it: Servizio
ja: サービス
ko: 서비스
ru: Сервис
zh_hans: 服务
zh_hant: 服務

source: Delete device
ar: حذف الجهاز
de: Gerät löschen
es: Eliminar dispositivo
fr: Supprimer l'appareil
it: Elimina dispositivo
ja: デバイスを削除
ko: 기기 삭제
ru: Удалить устройство
zh_hans: 删除设备
zh_hant: 刪除設備

# confirm_delete_device
source: Are you sure to delete this device?
ar: هل أنت متأكد من حذف هذا الجهاز؟
de: Möchten Sie dieses Gerät wirklich löschen?
es: ¿Está seguro de eliminar este dispositivo?
fr: Êtes-vous sûr de vouloir supprimer cet appareil ?
it: Sei sicuro di voler eliminare questo dispositivo?
ja: このデバイスを削除してもよろしいですか？
ko: 이 기기를 삭제하시겠습니까?
ru: Вы уверены, что хотите удалить это устройство?
zh_hans: 确认删除此设备？
zh_hant: 確認刪除此設備？

source: Wake-up Device
ar: إيقاظ الجهاز
de: Gerät aufwecken
es: Despertar dispositivo
fr: Réveiller l'appareil
it: Sveglia dispositivo
ja: デバイスを起動
ko: 기기 깨우기
ru: Пробудить устройство
zh_hans: 唤醒设备
zh_hant: 喚醒設備

# wake_up_device_notes1
source: For the first use, please select 'Set Physical Address'. Once the physical address has been set, you can directly click' Wake Up Device '.
ar: في الاستخدام الأول، اختر 'تعيين العنوان الفيزيائي'. بعد التعيين، يمكنك النقر مباشرة على 'إيقاظ الجهاز'.
de: Beim ersten Gebrauch wählen Sie 'Physikalische Adresse setzen'. Nach dem Setzen können Sie direkt auf 'Gerät aufwecken' klicken.
es: Para el primer uso, seleccione 'Establecer dirección física'. Una vez establecida, puede hacer clic directamente en 'Despertar dispositivo'.
fr: Pour la première utilisation, sélectionnez 'Définir l'adresse physique'. Une fois définie, vous pouvez cliquer directement sur 'Réveiller l'appareil'.
it: Per il primo utilizzo, seleziona 'Imposta indirizzo fisico'. Una volta impostato, puoi cliccare direttamente su 'Sveglia dispositivo'.
ja: 初回使用時は「物理アドレスを設定」を選択してください。物理アドレスが設定されると、「デバイスを起動」を直接クリックできます。
ko: 첫 사용 시 '물리적 주소 설정'을 선택하세요. 물리적 주소가 설정되면 '기기 깨우기'를 직접 클릭할 수 있습니다.
ru: При первом использовании выберите 'Установить физический адрес'. После установки можно нажать 'Пробудить устройство'.
zh_hans: 第一次使用请选择'设置物理地址'，设置过物理地址可以直接点击'唤醒设备'。
zh_hant: 第一次使用請選擇'設置物理地址'，設置過物理地址可以直接點擊'喚醒設備'。

source: Reset physical address
ar: إعادة تعيين العنوان الفيزيائي
de: Physikalische Adresse zurücksetzen
es: Restablecer dirección física
fr: Réinitialiser l'adresse physique
it: Reimposta indirizzo fisico
ja: 物理アドレスをリセット
ko: 물리적 주소 재설정
ru: Сбросить физический адрес
zh_hans: 重设物理地址
zh_hant: 重設物理地址

source: Set physical address
ar: تعيين العنوان الفيزيائي
de: Physikalische Adresse setzen
es: Establecer dirección física
fr: Définir l'adresse physique
it: Imposta indirizzo fisico
ja: 物理アドレスを設定
ko: 물리적 주소 설정
ru: Установить физический адрес
zh_hans: 设置物理地址
zh_hant: 設置物理地址

# physical_address
source: MAC
zh_hans: 物理地址
zh_hant: 物理地址

# the_physical_address_of_the_machine
source: The physical address of the machine's wired network card
ar: العنوان الفيزيائي لبطاقة الشبكة السلكية للجهاز
de: Die physikalische Adresse der kabelgebundenen Netzwerkkarte der Maschine
es: La dirección física de la tarjeta de red cableada de la máquina
fr: L'adresse physique de la carte réseau câblée de la machine
it: L'indirizzo fisico della scheda di rete cablata della macchina
ja: マシンの有線ネットワークカードの物理アドレス
ko: 기기의 유선 네트워크 카드 물리적 주소
ru: Физический адрес проводной сетевой карты машины
zh_hans: 机器有线网卡的物理地址
zh_hant: 機器有線網卡的物理地址

# set
source: Set up
de: Setzen
es: Establecer
fr: Définir
it: Imposta
ja: 設定
ko: 설정
zh_hans: 设置
zh_hant: 設置

# device_id
source: This device ID (simplified)
de: Diese Geräte-ID (vereinfacht)
es: ID del dispositivo (simplificado)
fr: ID de cet appareil (simplifié)
it: ID dispositivo (semplificato)
ja: このデバイスID（簡略化）
ko: 이 기기 ID（간소화）
zh_hans: 本设备id(简化后)
zh_hant: 本設備id(簡化後)

# gateway_id
source: Internal network ID (simplified)
de: Interne Netzwerk-ID (vereinfacht)
es: ID de red interna (simplificado)
fr: ID du réseau interne (simplifié)
it: ID rete interna (semplificato)
ja: 内部ネットワークID（簡略化）
ko: 내부 네트워크 ID（간소화）
zh_hans: 内网id(简化后)
zh_hant: 內網id(簡化後)

# addr
source: Address
de: Adresse
es: Dirección
fr: Adresse
it: Indirizzo
ja: アドレス
ko: 주소
zh_hans: 地址
zh_hant: 地址

source: Copy successful!
ar: تم النسخ بنجاح!
de: Kopieren erfolgreich!
es: ¡Copia exitosa!
fr: Copie réussie !
it: Copia riuscita!
ja: コピー成功！
ko: 복사 성공！
ru: Копирование успешно!
zh_hans: 复制成功!
zh_hant: 複製成功!

source: Device details
ar: تفاصيل الجهاز
de: Gerätedetails
es: Detalles del dispositivo
fr: Détails de l'appareil
it: Dettagli dispositivo
ja: デバイス詳細
ko: 기기 상세
ru: Детали устройства
zh_hans: 设备详情
zh_hant: 設備詳情

source: Internal network devices
ar: أجهزة الشبكة الداخلية
de: Interne Netzwerkgeräte
es: Dispositivos de red interna
fr: Appareils réseau internes
it: Dispositivi di rete interna
ja: 内部ネットワークデバイス
ko: 내부 네트워크 기기
ru: Устройства внутренней сети
zh_hans: 内网设备
zh_hant: 內網設備

source: Add Device
ar: إضافة جهاز
de: Gerät hinzufügen
es: Agregar dispositivo
fr: Ajouter un appareil
it: Aggiungi dispositivo
ja: デバイスを追加
ko: 기기 추가
ru: Добавить устройство
zh_hans: 添加设备
zh_hant: 添加設備

source: IP address of remote intranet
ar: عنوان IP للشبكة الداخلية البعيدة
de: IP-Adresse des entfernten Intranets
es: Dirección IP de la intranet remota
fr: Adresse IP de l'intranet distant
it: Indirizzo IP della intranet remota
ja: リモートイントラネットのIPアドレス
ko: 원격 인트라넷 IP 주소
ru: IP-адрес удалённой интранет-сети
zh_hans: 远程内网的IP
zh_hant: 遠程內網的IP

source: IP address of internal network devices
ar: عنوان IP لأجهزة الشبكة الداخلية
de: IP-Adresse der internen Netzwerkgeräte
es: Dirección IP de los dispositivos de red interna
fr: Adresse IP des appareils du réseau interne
it: Indirizzo IP dei dispositivi di rete interna
ja: 内部ネットワークデバイスのIPアドレス
ko: 내부 네트워크 기기 IP 주소
ru: IP-адрес устройств внутренней сети
zh_hans: 内网设备的IP
zh_hant: 內網設備的IP

source: Create device failed
de: Gerät erstellen fehlgeschlagen
es: Error al crear dispositivo
fr: Échec de la création de l'appareil
it: Creazione dispositivo fallita
ja: デバイスの作成に失敗しました
ko: 기기 생성 실패
zh_hans: 创建设备失败
zh_hant: 創建設備失敗

source: Camera scan code prompt!
de: Kamera-Scan-Code-Aufforderung!
es: ¡Solicitud de escaneo de código con cámara!
fr: Demande de scan de code par caméra!
it: Richiesta scansione codice con fotocamera!
ja: カメラスキャンコードのプロンプト！
ko: 카메라 스캔 코드 프롬프트！
zh_hans: 摄像头扫码提示！
zh_hant: 攝像頭掃碼提示！

# camera_scan_code_prompt_content
source: Please note that by clicking on 'OK' below, we will request camera permission to scan the code
de: Beim Klicken auf 'OK' unten werden wir die Kamera-Berechtigung zum Scannen des Codes anfordern
es: Al hacer clic en 'OK' a continuación, solicitaremos permiso de cámara para escanear el código
fr: En cliquant sur 'OK' ci-dessous, nous demanderons l'autorisation de la caméra pour scanner le code
it: Cliccando su 'OK' qui sotto, richiederemo il permesso della fotocamera per scansionare il codice
ja: 下の「OK」をクリックすると、コードをスキャンするためのカメラ権限をリクエストします
ko: 아래 '확인'을 클릭하면 코드를 스캔하기 위한 카메라 권한을 요청합니다
zh_hans: 请注意，点击下方 确定 我们将请求摄像头权限进行扫码
zh_hant: 請注意，點擊下方 確定 我們將請求攝像頭權限進行掃碼

# select_the_network_where_the_remote_host_is_located
source: Please select the network where the remote host is located
de: Wählen Sie das Netzwerk aus, in dem sich der Remote-Host befindet
es: Seleccione la red donde se encuentra el host remoto
fr: Sélectionnez le réseau où se trouve l'hôte distant
it: Seleziona la rete dove si trova l'host remoto
ja: リモートホストが配置されているネットワークを選択してください
ko: 원격 호스트가 위치한 네트워크를 선택하세요
zh_hans: 请选择远程主机所在网络
zh_hant: 請選擇遠程主機所在網絡

# confirm
source: OK
ja: 確認
zh_hans: 确定
zh_hant: 確定

# udp_port_list_title
source: UDP Port List
ar: قائمة منافذ UDP
de: UDP-Portliste
es: Lista de puertos UDP
fr: Liste des ports UDP
it: Elenco porte UDP
ja: UDPポートリスト
ko: UDP 포트 목록
ru: Список UDP-портов
zh_hans: UDP端口列表
zh_hant: UDP端口列表

# my_udp_port
source: My UDP
ar: UDP الخاص بي
de: Mein UDP
es: Mi UDP
fr: Mon UDP
it: Il mio UDP
ja: マイUDP
ko: 내 UDP
ru: Мой UDP
zh_hans: 我的UDP
zh_hant: 我的UDP

source: Delete UDP
ar: حذف UDP
de: UDP löschen
es: Eliminar UDP
fr: Supprimer UDP
it: Elimina UDP
ja: UDPを削除
ko: UDP 삭제
ru: Удалить UDP
zh_hans: 删除UDP
zh_hant: 刪除UDP

# confirm_to_delete_this_udp
source: Are you sure to delete this UDP?
ar: حذف هذا UDP؟
de: Dieses UDP wirklich löschen?
es: ¿Eliminar este UDP?
fr: Supprimer ce UDP?
it: Eliminare questo UDP?
ja: このUDPを削除してもよろしいですか？
ko: 이 UDP를 삭제하시겠습니까?
ru: Удалить этот UDP?
zh_hans: 确认删除此UDP?
zh_hant: 確認刪除此UDP?

# please_scan_the_qr_code
source: Please scan the OpenIoTHub gateway QR code
ar: امسح رمز QR لبوابة OpenIoTHub
de: Bitte scannen Sie den OpenIoTHub-Gateway-QR-Code
es: Por favor escanee el código QR de la puerta de enlace OpenIoTHub
fr: Veuillez scanner le code QR de la passerelle OpenIoTHub
it: Scansiona il codice QR del gateway OpenIoTHub
ja: OpenIoTHubゲートウェイのQRコードをスキャンしてください
ko: OpenIoTHub 게이트웨이 QR 코드를 스캔하세요
ru: Отсканируйте QR-код шлюза OpenIoTHub
zh_hans: 请扫码云亿连网关提供的二维码
zh_hant: 請掃碼雲億連網關提供的二維碼

# scan_the_qr_code
source: Scan QR code
ar: مسح رمز QR
de: QR-Code scannen
es: Escanear código QR
fr: Scanner le code QR
it: Scansiona codice QR
ja: QRコードをスキャン
ko: QR 코드 스캔
ru: Сканировать QR-код
zh_hans: 扫码二维码
zh_hant: 掃碼二維碼

source: Unsupported QR code
ar: رمز QR غير مدعوم
de: Nicht unterstützter QR-Code
es: Código QR no compatible
fr: Code QR non pris en charge
it: Codice QR non supportato
ja: サポートされていないQRコード
ko: 지원되지 않는 QR 코드
ru: Неподдерживаемый QR-код
zh_hans: 不支持的二维码
zh_hant: 不支援的二維碼

source: Unsupported Uri path
ar: مسار Uri غير مدعوم
de: Nicht unterstützter Uri-Pfad
es: Ruta Uri no compatible
fr: Chemin Uri non pris en charge
it: Percorso Uri non supportato
ja: サポートされていないUriパス
ko: 지원되지 않는 Uri 경로
ru: Неподдерживаемый путь Uri
zh_hans: 不支持的Uri路径
zh_hant: 不支援的Uri路徑

source: Adding gateway to my account failed
ar: فشل إضافة البوابة إلى حسابي
de: Hinzufügen des Gateways zu meinem Konto fehlgeschlagen
es: Error al añadir puerta de enlace a mi cuenta
fr: Échec de l'ajout de la passerelle à mon compte
it: Aggiunta gateway al mio account fallita
ja: アカウントへのゲートウェイ追加に失敗しました
ko: 계정에 게이트웨이 추가 실패
ru: Ошибка добавления шлюза в аккаунт
zh_hans: 添加网关到我的账户失败
zh_hant: 添加網關到我的賬戶失敗

# add_gateway_failed
source: Adding gateway failed
ar: فشل إضافة البوابة
de: Gateway hinzufügen fehlgeschlagen
es: Error al añadir puerta de enlace
fr: Échec de l'ajout de la passerelle
it: Aggiunta gateway fallita
ja: ゲートウェイの追加に失敗しました
ko: 게이트웨이 추가 실패
ru: Ошибка добавления шлюза
zh_hans: 添加网关失败
zh_hant: 添加網關失敗

# add_gateway_successful
source: Successfully added gateway!
ar: تمت إضافة البوابة بنجاح!
de: Gateway erfolgreich hinzugefügt!
es: ¡Puerta de enlace añadida exitosamente!
fr: Passerelle ajoutée avec succès!
it: Gateway aggiunto con successo!
ja: ゲートウェイの追加に成功しました！
ko: 게이트웨이 추가 성공！
ru: Шлюз успешно добавлен!
zh_hans: 添加网关成功！
zh_hant: 添加網關成功！

# login_failed
source: Login failed, please try again!
ar: فشل تسجيل الدخول، حاول مرة أخرى!
de: Anmeldung fehlgeschlagen, bitte versuchen Sie es erneut!
es: Error de inicio de sesión, ¡inténtelo de nuevo!
fr: Échec de la connexion, veuillez réessayer!
it: Accesso fallito, riprova!
ja: ログインに失敗しました。もう一度お試しください！
ko: 로그인 실패，다시 시도하세요！
ru: Ошибка входа, попробуйте снова!
zh_hans: 登录失败,请重新登录
zh_hant: 登錄失敗
