Repository: OpenIoTHub/OpenIoTHub
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ja, ko, ru, zh_hans, zh_hant

# access_ports_content
source: Click the button below to navigate to the host list page, select a host to enter its port list, then click any port to access the remote port (you may need to choose an access method)
ar: انقر على الزر أدناه للانتقال إلى صفحة قائمة المضيفين، اختر مضيفاً للدخول إلى قائمة منافذه، ثم انقر على أي منفذ للوصول إلى المنفذ البعيد (قد تحتاج إلى اختيار طريقة الوصول)
de: Klicken Sie auf die Schaltfläche unten, um zur Host-Listenseite zu navigieren, wählen Sie einen Host aus, um zu dessen Port-Liste zu gelangen, dann klicken Sie auf einen Port, um auf den Remote-Port zuzugreifen (Sie müssen möglicherweise eine Zugriffsmethode wählen)
es: Haga clic en el botón de abajo para ir a la página de lista de hosts, seleccione un host para entrar a su lista de puertos, luego haga clic en cualquier puerto para acceder al puerto remoto (puede necesitar elegir un método de acceso)
fr: Cliquez sur le bouton ci-dessous pour accéder à la page de liste des hôtes, sélectionnez un hôte pour entrer dans sa liste de ports, puis cliquez sur n'importe quel port pour accéder au port distant (vous devrez peut-être choisir une méthode d'accès)
it: Clicca il pulsante sotto per navigare alla pagina lista host, seleziona un host per entrare nella sua lista porte, poi clicca qualsiasi porta per accedere alla porta remota (potresti dover scegliere un metodo di accesso)
ja: 下のボタンをクリックしてホスト一覧ページに移動し、 ホストを選択してポート一覧に入り、 任意のポートをクリックしてリモートポートにアクセスしてください（アクセス方法を選択する必要がある場合があります）
ko: 아래 버튼을 클릭하여 호스트 목록 페이지로 이동한 후 호스트를 선택하여 포트 목록에 들어가고 포트를 클릭하여 원격 포트에 액세스하세요（액세스 방법을 선택해야 할 수 있습니다）
ru: Нажмите кнопку ниже, чтобы перейти на страницу списка хостов, выберите хост, чтобы войти в его список портов, затем нажмите на любой порт, чтобы получить доступ к удалённому порту (возможно, потребуется выбрать метод доступа)
zh_hans: 点击下方按钮跳转到主机列表页面， 点击主机进入端口列表页面， 点击任意端口访问远程端口(可能需要选择访问方式)
zh_hant: 點擊下方按鈕跳轉到主機列表頁面， 點擊主機進入端口列表頁面， 點擊任意端口訪問遠程端口(可能需要選擇訪問方式)

source: Last Step
ar: الخطوة الأخيرة
de: Letzter Schritt
es: Último paso
fr: Dernière étape
it: Ultimo passo
ja: 最後のステップ
ko: 마지막 단계
ru: Последний шаг
zh_hans: 上一步
zh_hant: 上一步

source: Next Step
ar: الخطوة التالية
de: Nächster Schritt
es: Siguiente paso
fr: Étape suivante
it: Passo successivo
ja: 次のステップ
ko: 다음 단계
ru: Следующий шаг
zh_hans: 下一步
zh_hant: 下一步

source: Skip This Guide
ar: تخطي هذا الدليل
de: Diese Anleitung überspringen
es: Omitir esta guía
fr: Ignorer ce guide
it: Salta questa guida
ja: このガイドをスキップ
ko: 이 가이드 건너뛰기
ru: Пропустить это руководство
zh_hans: 跳过本指导
zh_hant: 跳过本指导

source: Open The Port
ar: فتح المنفذ
de: Port öffnen
es: Abrir el puerto
fr: Ouvrir le port
it: Apri la porta
ja: ポートを開く
ko: 포트 열기
ru: Открыть порт
zh_hans: 打开端口
zh_hant: 打開端口

# add_port_button
source: Add Port
ar: إضافة منفذ
de: Port hinzufügen
es: Añadir puerto
fr: Ajouter un port
it: Aggiungi porta
ja: ポートを追加
ko: 포트 추가
ru: Добавить порт
zh_hans: 添加端口
zh_hant: 添加端口

# open_gateway_guide
source: Open the OpenIoTHub gateway home page
ar: فتح الصفحة الرئيسية لبوابة OpenIoTHub
de: OpenIoTHub-Gateway-Startseite öffnen
es: Abrir la página principal de la puerta de enlace OpenIoTHub
fr: Ouvrir la page d'accueil de la passerelle OpenIoTHub
it: Apri la homepage del gateway OpenIoTHub
ja: OpenIoTHubゲートウェイのホームページを開く
ko: OpenIoTHub 게이트웨이 홈페이지 열기
ru: Открыть главную страницу шлюза OpenIoTHub
zh_hans: 打开网关软件主页
zh_hant: 打開雲億連網關軟件主頁

source: Ports
ar: منافذ
es: Puertos
it: Porte
ja: ポート
ko: 포트
ru: Порты

source: Remote LAN Browser
ar: متصفح LAN البعيد
es: Navegador LAN remoto
fr: Navigateur LAN distant
it: Browser LAN remoto
ja: リモートLANブラウザ
ko: 원격 LAN 브라우저
ru: Удалённый LAN-браузер

# install_gateway_url
source: Install gateway
ar: تثبيت البوابة
de: Gateway installieren
es: Instalar puerta de enlace
fr: Installer la passerelle
it: Installa gateway
ja: ゲートウェイをインストール
ko: 게이트웨이 설치
ru: Установить шлюз
