Repository: OpenIoTHub/OpenIoTHub
Catalog: lib/l10n/intl_*.arb
Languages: ar, de, es, fr, it, ja, ko, ru, zh_hans, zh_hant

# please_use_the_magnifying_glass_in_the_upper_right_corner
source: Please use the top right corner to discover the gateway or add the gateway by scanning the QR code
ar: استخدم العدسة المكبرة في الزاوية اليمنى العلوية للبحث عن البوابة أو أضفها بمسح رمز QR
de: Verwenden Sie die Lupe oben rechts, um das Gateway zu finden oder fügen Sie es durch Scannen des QR-Codes hinzu
es: Use la lupa en la esquina superior derecha para descubrir la puerta de enlace o añádala escaneando el código QR
fr: Utilisez la loupe en haut à droite pour découvrir la passerelle ou ajoutez-la en scannant le code QR
it: Usa la lente d'ingrandimento in alto a destra per scoprire il gateway o aggiungilo scansionando il codice QR
ja: 右上の拡大鏡を使用してゲートウェイを検出するか、QRコードをスキャンしてゲートウェイを追加してください
ko: 오른쪽 상단의 돋보기를 사용하여 게이트웨이를 검색하거나 QR 코드를 스캔하여 게이트웨이를 추가하세요
ru: Используйте лупу в правом верхнем углу для поиска шлюза или добавьте его, отсканировав QR-код
zh_hans: 请使用右上角发现网关或者通过扫描二维码添加网关
zh_hant: 請使用右上角發現閘道或者通過掃描二維碼添加閘道

# add_a_gateway
source: Add a remote gateway
ar: إضافة بوابة بعيدة
de: Remote-Gateway hinzufügen
es: Añadir puerta de enlace remota
fr: Ajouter une passerelle distante
it: Aggiungi gateway remoto
ja: リモートゲートウェイを追加
ko: 원격 게이트웨이 추가
ru: Добавить удалённый шлюз
zh_hans: 添加一个远程网关

# install_gateway
source: Install a gateway for the local area network
ar: تثبيت بوابة للشبكة المحلية
de: Gateway für das lokale Netzwerk installieren
es: Instalar puerta de enlace para la red local
fr: Installer une passerelle pour le réseau local
it: Installa gateway per la rete locale
ja: ローカルネットワーク用ゲートウェイをインストール
ko: 로컬 네트워크용 게이트웨이 설치
ru: Установить шлюз для локальной сети
zh_hans: 局域网安装网关

source: Delete result
ar: نتيجة الحذف
de: Lösch-Ergebnis
es: Resultado de eliminación
fr: Résultat de suppression
it: Risultato eliminazione
ja: 削除結果
ko: 삭제 결과
ru: Результат удаления
zh_hans: 删除结果
zh_hant: 刪除結果

# delete_successful
source: Delete successfully!
ar: تم الحذف بنجاح!
de: Erfolgreich gelöscht!
es: ¡Eliminado exitosamente!
fr: Supprimé avec succès!
it: Eliminato con successo!
ja: 削除に成功しました！
ko: 삭제되었습니다！
ru: Успешно удалено!
zh_hans: 删除成功！
zh_hant: 刪除成功！

source: Delete failed!
ar: فشل الحذف!
de: Löschen fehlgeschlagen!
es: ¡Eliminación fallida!
fr: Échec de suppression!
it: Eliminazione fallita!
ja: 削除に失敗しました！
ko: 삭제 실패！
ru: Ошибка удаления!
zh_hans: 删除失败！
zh_hant: 刪除失敗！

source: Web browser
ar: متصفح الويب
es: Navegador web
fr: Navigateur web
it: Browser web
ja: Webブラウザ
ko: 웹 브라우저
ru: Веб-браузер
zh_hans: 网页浏览器
zh_hant: 網頁瀏覽器

# mdns_service_list
source: Mdns list
ar: قائمة mDNS
de: mDNS-Liste
es: Lista mDNS
fr: Liste mDNS
it: Lista mDNS
ja: mDNSリスト
ko: mDNS 목록
ru: Список mDNS
zh_hans: mdns列表
zh_hant: mdns列表

source: Delete Gateway
ar: حذف البوابة
de: Gateway löschen
es: Eliminar puerta de enlace
fr: Supprimer la passerelle
it: Elimina gateway
ja: ゲートウェイを削除
ko: 게이트웨이 삭제
ru: Удалить шлюз
zh_hans: 删除网关
zh_hant: 刪除網關

# confirm_delete_gateway
source: Are you sure to delete this gateway?
ar: حذف هذه البوابة؟
de: Dieses Gateway wirklich löschen?
es: ¿Eliminar esta puerta de enlace?
fr: Supprimer cette passerelle?
it: Eliminare questo gateway?
ja: このゲートウェイを削除してもよろしいですか？
ko: 이 게이트웨이를 삭제하시겠습니까？
ru: Удалить этот шлюз?
zh_hans: 确认删除此网关？
zh_hant: 確認刪除此網關？

source: After simplification
ar: بعد التبسيط
de: Nach Vereinfachung
es: Después de simplificación
fr: Après simplification
it: Dopo semplificazione
ja: 簡略化後
ko: 간소화 후
ru: После упрощения
zh_hans: 简化后
zh_hant: 簡化後

source: Connection code (simplified)
ar: رمز الاتصال (مبسط)
de: Verbindungscode (vereinfacht)
es: Código de conexión (simplificado)
fr: Code de connexion (simplifié)
it: Codice connessione (semplificato)
ja: 接続コード（簡略版）
ko: 연결 코드（간소화）
ru: Код подключения (упрощённый)
zh_hans: 连接码(简化后)
zh_hant: 連接碼(簡化後)

source: P2P connection status
ar: حالة اتصال P2P
de: P2P-Verbindungsstatus
es: Estado de conexión P2P
fr: Statut de connexion P2P
it: Stato connessione P2P
ja: P2P接続ステータス
ko: P2P 연결 상태
ru: Статус P2P-соединения
zh_hans: P2P连接状态
zh_hant: P2P連接狀態

source: Modify
ar: تعديل
de: Ändern
es: Modificar
fr: Modifier
it: Modifica
ja: 変更
ko: 수정
ru: Изменить
zh_hans: 修改
zh_hant: 修改

# gateway_config_notes1
source: The token for the gateway has been copied to the clipboard! You can run this token as a gateway parameter or add it to the configuration file: bash>gateway-go-t<your token>
ar: تم نسخ رمز البوابة إلى الحافظة! يمكنك تشغيله كمعامل أو إضافته إلى ملف الإعدادات: bash>gateway-go-t<رمزك>
de: Das Gateway-Token wurde in die Zwischenablage kopiert! Sie können dieses Token als Gateway-Parameter ausführen oder zur Konfigurationsdatei hinzufügen: bash>gateway-go-t<Ihr Token>
es: ¡El token de la puerta de enlace se ha copiado al portapapeles! Puede ejecutar este token como parámetro o añadirlo al archivo de configuración: bash>gateway-go-t<su token>
fr: Le token de la passerelle a été copié dans le presse-papiers! Vous pouvez exécuter ce token comme paramètre ou l'ajouter au fichier de configuration: bash>gateway-go-t<votre token>
it: Il token del gateway è stato copiato negli appunti! Puoi eseguirlo come parametro o aggiungerlo al file di configurazione: bash>gateway-go-t<tuo token>
ja: ゲートウェイのトークンがクリップボードにコピーされました。bash>gateway-go-t<トークン> として実行するか、設定ファイルに追加してください。
ko: 게이트웨이 토큰이 클립보드에 복사되었습니다. bash>gateway-go-t<토큰>으로 실행하거나 설정 파일에 추가하세요.
ru: Токен шлюза скопирован в буфер обмена! Вы можете запустить его как параметр или добавить в файл конфигурации: bash>gateway-go-t<ваш токен>
zh_hans: 网关的token已经复制到了剪切板！你可以将此token作为网关参数运行或者添加到配置文件：bash>gateway-go -t <你的token>
zh_hant: 網關的token已經複製到了剪切板！你可以將此token作為網關參數運行或者添加到配置文件：bash>gateway-go -t <你的token>

# gateway_config_notes2
source: Copy Gateway Token
ar: نسخ رمز البوابة
de: Gateway-Token kopieren
es: Copiar token de puerta de enlace
fr: Copier le token de la passerelle
it: Copia token gateway
ja: ゲートウェイトークンをコピー
ko: 게이트웨이 토큰 복사
ru: Копировать токен шлюза
zh_hans: 复制网关Token
zh_hant: 複製網關Token

# gateway_config_notes3
source: The configuration file of the gateway has been copied to the clipboard! You can copy this configuration content to the gateway configuration file (gateway-go. yaml) now
ar: تم نسخ ملف الإعدادات إلى الحافظة! الصق المحتوى في gateway-go.yaml
de: Die Gateway-Konfigurationsdatei wurde in die Zwischenablage kopiert! Sie können diesen Konfigurationsinhalt jetzt in die Gateway-Konfigurationsdatei (gateway-go.yaml) kopieren
es: ¡El archivo de configuración se ha copiado al portapapeles! Puede copiar este contenido al archivo gateway-go.yaml
fr: Le fichier de configuration a été copié dans le presse-papiers! Vous pouvez copier ce contenu dans gateway-go.yaml
it: Il file di configurazione è stato copiato negli appunti! Puoi copiare questo contenuto in gateway-go.yaml
ja: ゲートウェイの設定がクリップボードにコピーされました。gateway-go.yaml に貼り付けてください。
ko: 게이트웨이 설정이 클립보드에 복사되었습니다. gateway-go.yaml에 붙여넣으세요.
ru: Файл конфигурации скопирован в буфер обмена! Скопируйте содержимое в gateway-go.yaml
zh_hans: 网关的配置文件已经复制到了剪切板！你可以将这个配置内容复制到网关的配置文件(gateway-go.yaml)了
zh_hant: 網關的配置文件已經複製到了剪切板！你可以將這個配置內容複製到網關的配置文件(gateway-go.yaml)了

# gateway_config_notes4
source: Copy gateway configuration content
ar: نسخ محتوى إعدادات البوابة
de: Gateway-Konfigurationsinhalt kopieren
es: Copiar configuración de puerta de enlace
fr: Copier le contenu de configuration
it: Copia contenuto configurazione gateway
ja: ゲートウェイ設定をコピー
ko: 게이트웨이 설정 복사
ru: Копировать содержимое конфигурации
zh_hans: 复制网关配置内容
zh_hant: 複製網關配置內容

# gateway_config_notes5
source: Network Details
ar: تفاصيل الشبكة
de: Netzwerkdetails
es: Detalles de red
fr: Détails du réseau
it: Dettagli rete
ja: ネットワーク詳細
ko: 네트워크 상세
ru: Детали сети
zh_hans: 网络详情
zh_hant: 網絡詳情

source: Failed to delete the configuration of the remote gateway
ar: فشل حذف إعدادات البوابة البعيدة
de: Fehler beim Löschen der Remote-Gateway-Konfiguration
es: Error al eliminar la configuración de la puerta de enlace remota
fr: Échec de la suppression de la configuration de la passerelle distante
it: Errore eliminazione configurazione gateway remoto
ja: リモートゲートウェイ設定の削除に失敗しました
ko: 원격 게이트웨이 설정 삭제 실패
ru: Ошибка удаления конфигурации удалённого шлюза
zh_hans: 删除远程网关的配置失败
zh_hant: 刪除遠程網關的配置失敗

source: Failed to delete mapping for local gateway
ar: فشل حذف تعيين البوابة المحلية
de: Fehler beim Löschen der Mapping für lokales Gateway
es: Error al eliminar el mapeo de la puerta de enlace local
fr: Échec de la suppression du mapping de la passerelle locale
it: Errore eliminazione mapping gateway locale
ja: ローカルゲートウェイのマッピング削除に失敗しました
ko: 로컬 게이트웨이 매핑 삭제 실패
ru: Ошибка удаления сопоставления локального шлюза
zh_hans: 删除本地网关的映射失败
zh_hant: 刪除本地網關的映射失敗

source: Successfully deleted gateway!
ar: تم حذف البوابة!
de: Gateway erfolgreich gelöscht!
es: ¡Puerta de enlace eliminada!
fr: Passerelle supprimée!
it: Gateway eliminato!
ja: ゲートウェイを削除しました！
ko: 게이트웨이를 삭제했습니다！
ru: Шлюз удалён!
zh_hans: 删除网关成功!
zh_hant: 刪除網關成功!

# modify_name
source: Change name:
ar: تغيير الاسم:
de: Namen ändern:
es: Cambiar nombre:
fr: Changer le nom:
it: Cambia nome:
ja: 名前を変更：
ko: 이름 변경：
ru: Изменить имя:
zh_hans: 修改名称：
zh_hant: 修改名稱：

source: Name
ar: الاسم
es: Nombre
fr: Nom
it: Nome
ja: 名前
ko: 이름
ru: Имя
zh_hans: 名称
zh_hant: 名稱

# please_input_new_name
source: Please enter a new name
ar: أدخل اسماً جديداً
de: Bitte geben Sie einen neuen Namen ein
es: Introduzca un nuevo nombre
fr: Saisissez un nouveau nom
it: Inserisci un nuovo nome
ja: 新しい名前を入力してください
ko: 새 이름을 입력하세요
ru: Введите новое имя
zh_hans: 请输入新的名称
zh_hant: 請輸入新的名稱

source: Privacy Policy
ar: سياسة الخصوصية
de: Datenschutzrichtlinie
es: Política de privacidad
fr: Politique de confidentialité
it: Politica sulla privacy
ja: プライバシーポリシー
ko: 개인정보 보호정책
ru: Политика конфиденциальности
zh_hans: 隐私政策
zh_hant: 隱私政策

source: Agree
ar: موافق
de: Zustimmen
es: Aceptar
fr: Accepter
it: Accetta
ja: 同意
ko: 동의
ru: Согласен
zh_hans: 同意
zh_hant: 同意

source: Feedback Channels
ar: قنوات التعليقات
de: Feedback-Kanäle
es: Canales de comentarios
fr: Canaux de commentaires
it: Canali feedback
ja: フィードバック
ko: 피드백
ru: Каналы обратной связи
zh_hans: 反馈渠道
zh_hant: 反饋渠道

source: If you do not agree with the Privacy Policy, please click to exit the application
ar: إذا لم توافق على سياسة الخصوصية، اخرج من التطبيق
de: Wenn Sie der Datenschutzrichtlinie nicht zustimmen, klicken Sie bitte, um die Anwendung zu beenden
es: Si no acepta la política de privacidad, salga de la aplicación
fr: Si vous n'acceptez pas la politique de confidentialité, quittez l'application
it: Se non accetti la politica sulla privacy, esci dall'app
ja: プライバシーポリシーに同意しない場合は、アプリを終了してください。
ko: 개인정보 보호정책에 동의하지 않으면 앱을 종료하세요.
ru: Если вы не согласны с политикой конфиденциальности, выйдите из приложения
zh_hans: 如果不同意《隐私政策》请点击 退出应用
zh_hant: 如果不同意《隱私政策》請點擊 退出應用

source: Exit the application
ar: الخروج من التطبيق
de: Anwendung beenden
es: Salir de la aplicación
fr: Quitter l'application
it: Esci dall'applicazione
ja: アプリを終了
ko: 앱 종료
ru: Выход из приложения
zh_hans: 退出应用
zh_hant: 退出應用

source: Agree to the Privacy Policy
ar: الموافقة على سياسة الخصوصية
de: Der Datenschutzrichtlinie zustimmen
es: Aceptar la política de privacidad
fr: Accepter la politique de confidentialité
it: Accetta la politica sulla privacy
ja: プライバシーポリシーに同意
ko: 개인정보 보호정책에 동의
ru: Принять политику конфиденциальности
zh_hans: 同意隐私政策
zh_hant: 同意隱私政策

source: Wechat
zh_hans: 微信
zh_hant: 微信

source: Tools
ar: أدوات
es: Herramientas
fr: Outils
it: Strumenti
ja: ツール
ko: 도구
ru: Инструменты
zh_hans: 工具
zh_hant: 工具

# skip_ad
source: Skip
ar: تخطي
de: Überspringen
es: Omitir
fr: Ignorer
it: Salta
ja: スキップ
ko: 건너뛰기
ru: Пропустить
zh_hans: 跳过
zh_hant: 跳過

# please_add_device_first
source: Please add the device first
ar: أضف الجهاز أولاً
de: Bitte fügen Sie zuerst das Gerät hinzu
es: Añada primero el dispositivo
fr: Ajoutez d'abord l'appareil
it: Aggiungi prima il dispositivo
ja: 先にデバイスを追加してください
ko: 먼저 기기를 추가하세요
ru: Сначала добавьте устройство
zh_hans: 请先添加设备
zh_hant: 請先添加設備

source: Failed to obtain the IoT list remotely
ar: فشل الحصول على قائمة IoT عن بُعد
de: Fehler beim Remote-Abrufen der IoT-Liste
es: Error al obtener la lista IoT remotamente
fr: Échec de l'obtention de la liste IoT à distance
it: Errore nel recupero lista IoT da remoto
ja: IoTリストのリモート取得に失敗しました
ko: IoT 목록 원격 조회 실패
ru: Ошибка получения списка IoT удалённо
zh_hans: 从远程获取物联网列表失败
zh_hant: 從遠程獲取物聯網列表失敗

source: Failure reason
ar: سبب الفشل
de: Fehlergrund
es: Motivo del fallo
fr: Raison de l'échec
it: Motivo del fallimento
ja: 失敗理由
ko: 실패 이유
ru: Причина ошибки
zh_hans: 失败原因
zh_hant: 失敗原因

# add_mqtt_devices
source: Add MQTT device
ar: إضافة جهاز MQTT
de: MQTT-Gerät hinzufügen
es: Añadir dispositivo MQTT
fr: Ajouter un appareil MQTT
it: Aggiungi dispositivo MQTT
ja: MQTTデバイスを追加
ko: MQTT 기기 추가
ru: Добавить устройство MQTT
zh_hans: 添加mqtt设备
zh_hant: 添加mqtt設備

# add_zip_devices
source: Add zip devices (zDC1, zTC1...)
ar: إضافة أجهزة zip (zDC1, zTC1...)
de: Zip-Geräte hinzufügen (zDC1, zTC1...)
es: Añadir dispositivos zip (zDC1, zTC1...)
fr: Ajouter des appareils zip (zDC1, zTC1...)
it: Aggiungi dispositivi zip (zDC1, zTC1...)
ja: zipデバイスを追加（zDC1, zTC1...）
ko: zip 기기 추가（zDC1, zTC1...）
ru: Добавить zip-устройства (zDC1, zTC1...)
zh_hans: 添加zip的设备(zDC1,zTC1...)
zh_hant: 添加zip的設備(zDC1,zTC1...)

# device_list
source: Devices list
ar: قائمة الأجهزة
de: Geräteliste
es: Lista de dispositivos
fr: Liste des appareils
it: Lista dispositivi
ja: デバイス一覧
ko: 기기 목록
ru: Список устройств
zh_hans: 设备列表
zh_hant: 設備列表

source: Add device to opneiothub
ar: إضافة جهاز إلى OpenIoTHub
de: Gerät zu OpenIoTHub hinzufügen
es: Añadir dispositivo a OpenIoTHub
fr: Ajouter un appareil à OpenIoTHub
it: Aggiungi dispositivo a OpenIoTHub
ja: OpenIoTHubにデバイスを追加
ko: OpenIoTHub에 기기 추가
ru: Добавить устройство в OpenIoTHub
zh_hans: 添加设备到云亿连
zh_hant: 添加設備到雲億連

# are_you_sure_to_add_this_device_to_openiothub
source: Are you sure to add this device to opneiothub?
ar: إضافة هذا الجهاز إلى OpenIoTHub؟
de: Dieses Gerät wirklich zu OpenIoTHub hinzufügen?
es: ¿Añadir este dispositivo a OpenIoTHub?
fr: Ajouter cet appareil à OpenIoTHub?
it: Aggiungere questo dispositivo a OpenIoTHub?
ja: このデバイスをOpenIoTHubに追加しますか？
ko: 이 기기를 OpenIoTHub에 추가하시겠습니까？
ru: Добавить это устройство в OpenIoTHub?
zh_hans: 确认添加该设备到云亿连？
zh_hant: 確認添加該設備到雲億連？

# you_havent_logged_in_yet
source: You haven't logged in yet! Please log in first and then add the device
ar: لم تسجل الدخول بعد! سجّل الدخول أولاً
de: Sie sind noch nicht angemeldet! Bitte melden Sie sich zuerst an und fügen Sie dann das Gerät hinzu
es: ¡No ha iniciado sesión! Inicie sesión primero
fr: Vous n'êtes pas connecté! Connectez-vous d'abord
it: Non hai ancora effettuato l'accesso! Accedi prima
ja: まだログインしていません。先にログインしてからデバイスを追加してください。
ko: 로그인 후 기기를 추가하세요.
ru: Вы не вошли! Сначала войдите
zh_hans: 您还没有登录!请先登录再添加设备
zh_hant: 您還沒有登錄!請先登錄再添加設備

# add_successful
source: Added successfully!
ar: تمت الإضافة بنجاح!
de: Erfolgreich hinzugefügt!
es: ¡Añadido exitosamente!
fr: Ajouté avec succès!
it: Aggiunto con successo!
ja: 追加しました！
ko: 추가되었습니다！
ru: Успешно добавлено!
zh_hans: 添加成功!
zh_hant: 添加成功!

source: Please add host first
ar: أضف المضيف أولاً
de: Bitte fügen Sie zuerst einen Host hinzu
es: Añada primero el host
fr: Ajoutez d'abord un hôte
it: Aggiungi prima un host
ja: 先にホストを追加してください
ko: 먼저 호스트를 추가하세요
ru: Сначала добавьте хост
zh_hans: 请先添加主机
zh_hant: 請先添加主機

source: No more prompts next time:
ar: عدم السؤال مرة أخرى:
de: Nächstes Mal keine Aufforderungen mehr:
es: No preguntar la próxima vez:
fr: Ne plus demander:
it: Non chiedere più:
ja: 次回から表示しない：
ko: 다음에 묻지 않기：
ru: Больше не спрашивать:
zh_hans: 下次不再提示：
zh_hant: 下次不再提示：

source: Network protocol
ar: بروتوكول الشبكة
de: Netzwerkprotokoll
es: Protocolo de red
fr: Protocole réseau
it: Protocollo di rete
ja: ネットワークプロトコル
ko: 네트워크 프로토콜
ru: Сетевой протокол
zh_hans: 网络协议
zh_hant: 網絡協議

source: Application protocol
ar: بروتوكول التطبيق
de: Anwendungsprotokoll
es: Protocolo de aplicación
fr: Protocole d'application
it: Protocollo applicazione
ja: アプリケーションプロトコル
ko: 애플리케이션 프로토콜
ru: Протокол приложения
zh_hans: 应用协议
zh_hant: 應用協議

# confirm_add_gateway
source: Are you sure to add a gateway?
ar: إضافة بوابة؟
de: Gateway wirklich hinzufügen?
es: ¿Añadir una puerta de enlace?
fr: Ajouter une passerelle?
it: Aggiungere un gateway?
ja: ゲートウェイを追加しますか？
ko: 게이트웨이를 추가하시겠습니까？
ru: Добавить шлюз?
zh_hans: 确认添加次网关到账户？
zh_hant: 確認添加網關到本賬號？

source: OK
zh_hans: 确定
zh_hant: 確定

# choose_an_network
source: Choose an remote network
ar: اختر شبكة بعيدة
de: Remote-Netzwerk wählen
es: Elegir una red remota
fr: Choisir un réseau distant
it: Scegli una rete remota
ja: リモートネットワークを選択
ko: 원격 네트워크 선택
ru: Выберите удалённую сеть
zh_hans: 选择一个远程网络
zh_hant: 選擇一個遠程網絡

source: Choose an host address
ar: اختر عنوان المضيف
de: Host-Adresse wählen
es: Elegir una dirección de host
fr: Choisir une adresse d'hôte
it: Scegli un indirizzo host
ja: ホストアドレスを選択
ko: 호스트 주소 선택
ru: Выберите адрес хоста
zh_hans: 选择一个远程主机地址
zh_hant: 選擇一個遠程主機地址

source: Fill in below
ar: املأ أدناه
de: Unten ausfüllen
es: Completar abajo
fr: Remplir ci-dessous
it: Compila sotto
ja: 以下を入力
ko: 아래 입력
ru: Заполните ниже
zh_hans: 不选择，下面填写
zh_hant: 不選擇，下面填寫

source: User Guide
ar: دليل المستخدم
de: Benutzerhandbuch
es: Guía del usuario
fr: Guide de l'utilisateur
it: Guida utente
ja: ユーザーガイド
ko: 사용자 가이드
ru: Руководство пользователя
zh_hans: 新手引导
zh_hant: 新手引導

# register_login
source: Login
ar: تسجيل الدخول
de: Anmelden
es: Iniciar sesión
fr: Connexion
it: Accesso
ja: ログイン
ko: 로그인
ru: Вход
zh_hans: 注册登录
zh_hant: 註冊登錄

# register_login_content
source: Click the button below, register and login your account
ar: انقر على الزر أدناه، سجّل وادخل إلى حسابك
de: Klicken Sie auf die Schaltfläche unten, um sich zu registrieren und anzumelden
es: Haga clic en el botón de abajo, regístrese e inicie sesión en su cuenta
fr: Cliquez sur le bouton ci-dessous, enregistrez-vous et connectez-vous à votre compte
it: Clicca il pulsante sotto, registrati e accedi al tuo account
ja: 下のボタンをクリックして、アカウントを登録・ログインしてください
ko: 아래 버튼을 클릭하여 계정을 등록하고 로그인하세요
ru: Нажмите кнопку ниже, зарегистрируйтесь и войдите в свой аккаунт
zh_hans: 点击下方按钮开始注册登录
zh_hant: 註冊登錄

# add_gateway
source: Gateway
ar: البوابة
es: Puerta de enlace
fr: Passerelle
ja: ゲートウェイ
ko: 게이트웨이
ru: Шлюз
zh_hans: 添加网关
zh_hant: 添加網關

# add_gateway_content
source: Select either scanning the QR code to add a gateway or discovering it via LAN from the two buttons below
ar: اختر إما مسح رمز QR لإضافة بوابة أو اكتشافها عبر LAN من الزرين أدناه
de: Wählen Sie eine der beiden Schaltflächen unten, um entweder den QR-Code zu scannen und ein Gateway hinzuzufügen oder es über LAN zu finden
es: Seleccione escanear el código QR para añadir una puerta de enlace o descubrirla por LAN desde los dos botones de abajo
fr: Sélectionnez soit de scanner le code QR pour ajouter une passerelle, soit de la découvrir via LAN depuis les deux boutons ci-dessous
it: Seleziona di scansionare il codice QR per aggiungere un gateway o di scoprirlo via LAN dai due pulsanti sotto
ja: 下の2つのボタンから、QRコードをスキャンしてゲートウェイを追加するか、LAN経由で検出してください
ko: 아래 두 버튼 중 하나를 선택하여 QR 코드를 스캔하여 게이트웨이를 추가하거나 LAN을 통해 검색하세요
ru: Выберите сканирование QR-кода для добавления шлюза или обнаружение его через LAN из двух кнопок ниже
zh_hans: 从下方两个按钮任选其一选择 扫码添加网关 还是 局域网发现 添加网关
zh_hant: 從下方兩個按鈕任選其一選擇 掃碼添加網關 還是 局域網發現 添加網關

# add_host
source: Host
ar: المضيف
fr: Hôte
ja: ホスト
ko: 호스트
ru: Хост
zh_hans: 添加主机
zh_hant: 添加主機

# add_host_content
source: Click the button below to navigate to the host list page, then tap the button in the lower-right corner to begin adding a remote host
ar: انقر على الزر أدناه للانتقال إلى صفحة قائمة المضيفين، ثم اضغط على الزر في الزاوية اليمنى السفلى لبدء إضافة مضيف بعيد
de: Klicken Sie auf die Schaltfläche unten, um zur Host-Listenseite zu navigieren, dann tippen Sie auf die Schaltfläche in der unteren rechten Ecke, um einen Remote-Host hinzuzufügen
es: Haga clic en el botón de abajo para ir a la página de lista de hosts, luego toque el botón en la esquina inferior derecha para comenzar a añadir un host remoto
fr: Cliquez sur le bouton ci-dessous pour accéder à la page de liste des hôtes, puis appuyez sur le bouton dans le coin inférieur droit pour commencer à ajouter un hôte distant
it: Clicca il pulsante sotto per navigare alla pagina lista host, poi tocca il pulsante nell'angolo in basso a destra per iniziare ad aggiungere un host remoto
ja: 下のボタンをクリックしてホスト一覧ページに移動し、 右下のボタンをタップしてリモートホストの追加を開始してください
ko: 아래 버튼을 클릭하여 호스트 목록 페이지로 이동한 후 오른쪽 하단의 버튼을 탭하여 원격 호스트 추가를 시작하세요
ru: Нажмите кнопку ниже, чтобы перейти на страницу списка хостов, затем нажмите кнопку в правом нижнем углу, чтобы начать добавление удалённого хоста
zh_hans: 点击下方按钮跳转到主机列表页面， 点击右下角按钮开始添加远程主机
zh_hant: 點擊下方按鈕跳轉到主機列表頁面， 點擊右下角按鈕開始添加遠程主機

# add_ports
source: Ports
ar: المنافذ
es: Puertos
it: Porte
ja: ポート
ko: 포트
ru: Порты
zh_hans: 添加端口
zh_hant: 添加端口

# add_ports_content
source: Click the button below to navigate to the host list page, select the host where you want to add ports, and configure the ports on that host
ar: انقر على الزر أدناه للانتقال إلى صفحة قائمة المضيفين، اختر المضيف حيث تريد إضافة المنافذ وقم بتكوين المنافذ على ذلك المضيف
de: Klicken Sie auf die Schaltfläche unten, um zur Host-Listenseite zu navigieren, wählen Sie den Host aus, auf dem Sie Ports hinzufügen möchten, und konfigurieren Sie die Ports auf diesem Host
es: Haga clic en el botón de abajo para ir a la página de lista de hosts, seleccione el host donde desea añadir puertos y configure los puertos en ese host
fr: Cliquez sur le bouton ci-dessous pour accéder à la page de liste des hôtes, sélectionnez l'hôte où vous souhaitez ajouter des ports et configurez les ports sur cet hôte
it: Clicca il pulsante sotto per navigare alla pagina lista host, seleziona l'host dove vuoi aggiungere porte e configura le porte su quell'host
ja: 下のボタンをクリックしてホスト一覧ページに移動し、 ポートを追加したいホストを選択して、そのホストでポートを設定してください
ko: 아래 버튼을 클릭하여 호스트 목록 페이지로 이동한 후 포트를 추가할 호스트를 선택하고 해당 호스트에서 포트를 구성하세요
ru: Нажмите кнопку ниже, чтобы перейти на страницу списка хостов, выберите хост, на котором хотите добавить порты, и настройте порты на этом хосте
zh_hans: 点击下方按钮跳转到主机列表页面， 点击需要添加端口的主机，在主机上添加端口
zh_hant: 點擊下方按鈕跳轉到主機列表頁面， 點擊需要添加端口的主機，在主機上添加端口

# access_ports
source: Access
ar: الوصول
de: Zugriff
es: Acceso
fr: Accès
it: Accesso
ja: アクセス
ko: 액세스
ru: Доступ
zh_hans: 访问端口
zh_hant: 訪問端口
