Repository: OpenIoTHub/OpenIoTHub
Catalog: packages/openiothub_plugin/lib/l10n/intl_*.arb
Languages: ar, es, fr, it, ru

source: RDP remote desktop
ar: سطح المكتب البعيد RDP
es: Escritorio remoto RDP
fr: Bureau à distance RDP
it: Desktop remoto RDP
ru: Удалённый рабочий стол RDP

source: Select server for gateway
ar: اختر الخادم للبوابة
es: Seleccionar servidor para gateway
fr: Choisir le serveur pour la passerelle
it: Seleziona server per gateway
ru: Выберите сервер для шлюза

source: Add gateway success！
ar: تمت إضافة البوابة！
es: Gateway añadido！
fr: Passerelle ajoutée！
it: Gateway aggiunto！
ru: Шлюз добавлен！

source: Login failed！
ar: فشل تسجيل الدخول！
es: Error de inicio de sesión！
fr: Échec de connexion！
it: Accesso fallito！
ru: Ошибка входа！

source: Add gateway failed!
ar: فشل إضافة البوابة!
es: Error al añadir gateway!
fr: Échec de l'ajout de la passerelle!
it: Aggiunta gateway fallita!
ru: Не удалось добавить шлюз!

# gateway_already_added
source: This gateway has been added by another user. Please contact the gateway administrator or clear the gateway configuration and restart the gateway
ar: أضاف مستخدم آخر هذه البوابة. تواصل مع المسؤول أو أعد تعيين الإعدادات.
es: Este gateway fue añadido por otro usuario. Contacte al administrador o borre la configuración y reinicie el gateway.
fr: Cette passerelle a été ajoutée par un autre utilisateur. Contactez l'administrateur ou réinitialisez la configuration.
it: Questo gateway è stato aggiunto da un altro utente. Contatta l'amministratore o reimposta la configurazione.
ru: Этот шлюз добавлен другим пользователем. Обратитесь к администратору или сбросьте конфигурацию.

# confirm_gateway_connect_this_server
source: Are you sure to add this gateway to this server?
ar: إضافة هذه البوابة إلى هذا الخادم؟
es: ¿Añadir este gateway a este servidor?
fr: Ajouter cette passerelle à ce serveur?
it: Aggiungere questo gateway a questo server?
ru: Добавить этот шлюз на сервер?

# get_gateway_login_status_failed
source: Get abnormal login status of gateway
ar: تعذر الحصول على حالة تسجيل دخول البوابة
es: No se pudo obtener el estado de inicio de sesión del gateway
fr: Impossible d'obtenir le statut de connexion de la passerelle
it: Impossibile ottenere lo stato di accesso del gateway
ru: Не удалось получить статус входа шлюза

source: Cancel
ar: إلغاء
es: Cancelar
fr: Annuler
it: Annulla
ru: Отмена

source: Add
ar: إضافة
es: Añadir
fr: Ajouter
it: Aggiungi
ru: Добавить

source: Onvif camera manager
ar: مدير كاميرات Onvif
es: Administrador de cámaras Onvif
fr: Gestionnaire de caméras Onvif
it: Gestore telecamere Onvif
ru: Менеджер камер Onvif

source: Confirm
ar: تأكيد
es: Confirmar
fr: Confirmer
it: Conferma
ru: Подтвердить

source: Delete
ar: حذف
es: Eliminar
fr: Supprimer
it: Elimina
ru: Удалить

source: Confirm delete onvif device?
ar: حذف جهاز Onvif؟
es: ¿Eliminar dispositivo Onvif?
fr: Supprimer l'appareil Onvif?
it: Eliminare dispositivo Onvif?
ru: Удалить устройство Onvif?

source: Onvif camera
ar: كاميرا Onvif
es: Cámara Onvif
fr: Caméra Onvif
it: Telecamera Onvif
ru: Камера Onvif

source: Add onvif camera
ar: إضافة كاميرا Onvif
es: Añadir cámara Onvif
fr: Ajouter une caméra Onvif
it: Aggiungi telecamera Onvif
ru: Добавить камеру Onvif

source: Name
ar: الاسم
es: Nombre
fr: Nom
it: Nome
ru: Имя

source: Custom name
ar: اسم مخصص
es: Nombre personalizado
fr: Nom personnalisé
it: Nome personalizzato
ru: Пользовательское имя

source: XAddr addr
ar: عنوان XAddr
es: Dirección XAddr
fr: Adresse XAddr
it: Indirizzo XAddr
ru: Адрес XAddr

# onvif_device_host_port
source: Onvif device addr:port
ar: جهاز Onvif عنوان:منفذ
es: Onvif dispositivo dir:puerto
fr: Onvif appareil adr:port
it: Onvif dispositivo ind:porta
ru: Onvif устройство адр:порт

source: Username
ar: اسم المستخدم
es: Usuario
fr: Utilisateur
it: Utente
ru: Пользователь

source: Onvif username
ar: مستخدم Onvif
es: Usuario Onvif
fr: Utilisateur Onvif
it: Utente Onvif
ru: Пользователь Onvif

source: Password
ar: كلمة المرور
es: Contraseña
fr: Mot de passe
ru: Пароль

source: Onvif password
ar: كلمة مرور Onvif
es: Contraseña Onvif
fr: Mot de passe Onvif
it: Password Onvif
ru: Пароль Onvif

source: Web browser
ar: متصفح الويب
es: Navegador web
fr: Navigateur web
it: Browser web
ru: Веб-браузер

source: Device name
ar: اسم الجهاز
es: Nombre del dispositivo
fr: Nom de l'appareil
it: Nome dispositivo
ru: Имя устройства

source: Device model
ar: طراز الجهاز
es: Modelo del dispositivo
fr: Modèle
it: Modello dispositivo
ru: Модель устройства

source: MAC addr
ar: عنوان MAC
es: Dirección MAC
fr: Adresse MAC
it: Indirizzo MAC
ru: MAC-адрес

source: Firmware author
ar: مؤلف البرنامج الثابت
es: Autor del firmware
fr: Auteur du firmware
it: Autore firmware
ru: Автор прошивки

source: Email
ar: البريد
es: Correo
ru: Электронная почта

source: Home page
ar: الصفحة الرئيسية
es: Página principal
fr: Page d'accueil
ru: Главная

source: Firmware repository
ar: مستودع البرنامج الثابت
es: Repositorio de firmware
fr: Dépôt firmware
it: Repository firmware
ru: Репозиторий прошивки

source: Firmware version
ar: إصدار البرنامج الثابت
es: Versión del firmware
fr: Version du firmware
it: Versione firmware
ru: Версия прошивки

source: Is local?
ar: محلي؟
es: ¿Es local?
fr: Local?
it: Locale?
ru: Локальное?

source: Yes
ar: نعم
es: Sí
fr: Oui
it: Sì
ru: Да

source: No
ar: لا
fr: Non
ru: Нет

source: Device ip
ar: IP الجهاز
es: IP del dispositivo
fr: IP de l'appareil
it: IP dispositivo
ru: IP устройства

source: Device port
ar: منفذ الجهاز
es: Puerto del dispositivo
fr: Port de l'appareil
it: Porta dispositivo
ru: Порт устройства

source: Device info
ar: معلومات الجهاز
es: Info del dispositivo
fr: Infos appareil
it: Info dispositivo
ru: Информация об устройстве

source: Modify device name
ar: تعديل اسم الجهاز
es: Modificar nombre del dispositivo
fr: Modifier le nom
it: Modifica nome dispositivo
ru: Изменить имя устройства

source: Input new device name
ar: أدخل الاسم الجديد
es: Introducir nuevo nombre
fr: Saisir le nouveau nom
it: Inserisci nuovo nome
ru: Введите новое имя

source: Delete device
ar: حذف الجهاز
es: Eliminar dispositivo
fr: Supprimer l'appareil
it: Elimina dispositivo
ru: Удалить устройство

source: Confirm delete device?
ar: حذف هذا الجهاز؟
es: ¿Eliminar este dispositivo?
fr: Supprimer cet appareil?
it: Eliminare questo dispositivo?
ru: Удалить это устройство?

source: Modify
ar: تعديل
es: Modificar
fr: Modifier
it: Modifica
ru: Изменить

source: Delete_success!
ar: تم الحذف!
es: ¡Eliminado!
fr: Supprimé!
it: Eliminato!
ru: Удалено!

source: Mdns info
ar: معلومات mDNS
es: Info mDNS
fr: Infos mDNS
it: Info mDNS
ru: Информация mDNS

source: Firmware url
ar: رابط البرنامج الثابت
es: URL del firmware
fr: URL du firmware
it: URL firmware
ru: URL прошивки

source: Start OTA
ar: بدء OTA
es: Iniciar OTA
fr: Démarrer OTA
it: Avvia OTA
ru: Запустить OTA

source: Temperature
ar: درجة الحرارة
es: Temperatura
fr: Température
it: Temperatura
ru: Температура

source: Humidity
ar: الرطوبة
es: Humedad
fr: Humidité
it: Umidità
ru: Влажность

source: Setting name
ar: اسم الإعداد
es: Nombre del ajuste
fr: Nom du réglage
it: Nome impostazione
ru: Название настройки

source: Upgrade firmware
ar: ترقية البرنامج الثابت
es: Actualizar firmware
fr: Mettre à jour le firmware
it: Aggiorna firmware
ru: Обновить прошивку

source: Switch control
ar: التحكم بالمفتاح
es: Control de interruptor
fr: Contrôle interrupteur
it: Controllo interruttore
ru: Управление переключателем

source: On
ar: تشغيل
es: Encendido
fr: Marche
it: Acceso
ru: Вкл

source: Off
ar: إيقاف
es: Apagado
fr: Arrêt
it: Spento
ru: Выкл

source: Effect
ar: التأثير
es: Efecto
fr: Effet
it: Effetto
ru: Эффект

source: Switch bottom
ar: قاعدة المفتاح
es: Base del interruptor
fr: Base interrupteur
it: Base interruttore
ru: Нижняя часть переключателя

source: Speed
ar: السرعة
es: Velocidad
fr: Vitesse
it: Velocità
ru: Скорость

source: Please input message
ar: أدخل الرسالة
es: Introduzca el mensaje
fr: Saisir le message
it: Inserisci messaggio
ru: Введите сообщение

source: Me
ar: أنا
es: Yo
fr: Moi
it: Io
ru: Я

source: Serial port
ar: منفذ تسلسلي
es: Puerto serie
fr: Port série
it: Porta seriale
ru: Последовательный порт

source: Please input linux login info
ar: أدخل بيانات Linux
es: Introduzca datos de Linux
fr: Saisir identifiants Linux
it: Inserisci credenziali Linux
ru: Введите данные Linux

# linux_username
source: L(U)inux username
ar: مستخدم Linux
es: Usuario Linux
fr: Utilisateur Linux
it: Utente Linux
ru: Пользователь Linux

source: SSH password
ar: كلمة مرور SSH
es: Contraseña SSH
fr: Mot de passe SSH
it: Password SSH
ru: Пароль SSH

source: Above mentioned SSH password
ar: كلمة مرور SSH أعلاه
es: Contraseña SSH anterior
fr: Mot de passe SSH ci-dessus
it: Password SSH sopra
ru: Пароль SSH выше

source: Connect
ar: اتصال
es: Conectar
fr: Connexion
it: Connetti
ru: Подключить

source: Please input user name
ar: أدخل اسم المستخدم
es: Introduzca usuario
fr: Saisir l'utilisateur
it: Inserisci utente
ru: Введите имя пользователя

source: Please input password
ar: أدخل كلمة المرور
es: Introduzca contraseña
fr: Saisir le mot de passe
it: Inserisci password
ru: Введите пароль

source: Login
ar: تسجيل الدخول
es: Iniciar sesión
fr: Connexion
it: Accedi
ru: Войти

source: Username and password cant be empty
ar: اسم المستخدم وكلمة المرور مطلوبان
es: Usuario y contraseña requeridos
fr: Utilisateur et mot de passe requis
it: Utente e password richiesti
ru: Имя пользователя и пароль обязательны

source: OK
ar: موافق
ru: ОК

# please_input_ssh_username_password
source: Please input ssh username and password
ar: أدخل اسم المستخدم وكلمة مرور SSH
es: Introduzca usuario y contraseña SSH
fr: Saisir utilisateur et mot de passe SSH
it: Inserisci utente e password SSH
ru: Введите имя пользователя и пароль SSH
